[{"uri":"https://redblue.ga/knowleges/ftfs-1","tags":[],"content":" 关于 -- 这 篇文章 的 核心思想 就是 ： 要 让 读者 在 不 看 任何 数学公式 的 情况 下 理解 傅里叶 分析 。 傅里叶 分析 不仅仅 是 一个 数学 工具 ， 更是 一种 可以 彻底 颠覆 一个 人 以前 世界观 的 思维 模式 。 但 不幸 的 是 ， 傅里叶 分析 的 公式 看起来 太 复杂 了 ， 所以 很多 大 一 新生 上来 就 懵 圈 并 从此 对 它 深恶痛绝 。 老实 说 ， 这么 有意思 的 东西 居然 成 了 大学 里 的 杀手 课程 ， 不得不 归咎于 编 教材 的 人 实在 是 太 严肃 了 。（ 您 把 教材 写 得 好玩 一点 会 死 吗 ？ 会 死 吗 ？） 所以 我 一直 想 写 一个 有意思 的 文章 来 解释 傅里叶 分析 ， 有 可能 的话 高中生 都 能看懂 的 那种 。 所以 ， 不管 读 到 这里 的 您 从事 何种 工作 ， 我 保证 您 都 能看懂 ， 并且 一定 将 体会 到 通过 傅里叶 分析 看到 世界 另 一个 样子 时 的 快感 。 至于 对于 已经 有 一定 基础 的 朋友 ， 也 希望 不要 看到 会 的 地方 就 急忙 往后 翻 ， 仔细 读 一定 会 有 新 的 发现 。———— 以上 是 定场诗 ———— 下面 进入 正题 ： 抱歉 ， 还是 要 啰嗦 一句 ： 其实 学习 本来 就 不是 易事 ， 我 写 这 篇文章 的 初衷 也 是 希望 大家 学习 起来 更加 轻松 ， 充满 乐趣 。 但是 千万 ！ 千万 不要 把 这 篇文章 收藏 起来 ， 或是 存 下 地址 ， 心里 想着 ： 以后 有 时间 再 看 。 这样 的 例子 太 多 了 ， 也许 几年 后 你 都 没有 再 打开 这个 页面 。 无论如何 ， 耐 下 心 ， 读 下去 。 这 篇文章 要 比 读 课本 要 轻松 、 开心 得 多 ……p.s. 本文 无论是  cos  还是  sin， 都 统一 用 “ 正弦波 ”（Sine Wave） 一 词 来 代表 简谐波 。 一 、 什么 是 频域 从 我们 出生 ， 我们 看到 的 世界 都 以 时间 贯穿 ， 股票 的 走势 、 人 的 身高 、 汽车 的 轨迹 都 会 随着 时间 发生 改变 。 这种 以 时间 作为 参照 来 观察 动态 世界 的 方法 我们 称 其 为 时域 分析 。 而 我们 也 想当然 的 认为 ， 世间 万物 都 在 随着 时间 不停 的 改变 ， 并且 永远 不会 静止 下来 。 但 如果 我 告诉 你 ， 用 另 一种 方法 来 观察 世界 的话 ， 你 会 发现 世界 是 永恒不变 的 ， 你 会 不会 觉得 我 疯 了 ？ 我 没有 疯 ， 这个 静止 的 世界 就 叫做 频域 。 先 举 一个 公式 上 并非 很 恰当 ， 但 意义 上 再 贴切 不过 的 例子 ： 在 你 的 理解 中 ， 一段 音乐 是 什么 呢 ？ 这 是 我们 对 音乐 最 普遍 的 理解 ， 一个 随着 时间 变化 的 震动 。 但 我 相信 对于 乐器 小 能手 们 来说 ， 音乐 更 直观 的 理解 是 这样 的 ： 好 的 ！ 下课 ， 同学 们 再见 。 是 的 ， 其实 这 一段 写 到 这里 已经 可以 结束 了 。 上 图 是 音乐 在 时域 的 样子 ， 而 下图 则 是 音乐 在 频域 的 样子 。 所以 频域 这 一 概念 对 大家 都 从不 陌生 ， 只是 从来 没 意识 到 而已 。 现在 我们 可以 回过头来 重新 看看 一 开始 那 句 痴人说梦 般的 话 ： 世界 是 永恒 的 。 将 以上 两 图 简化 ： 时域 ： 频域 ： 在 时域 ， 我们 观察 到 钢琴 的 琴弦 一会 上 一会 下 的 摆动 ， 就 如同 一支 股票 的 走势 ； 而 在 频域 ， 只有 那 一个 永恒 的 音符 。 所以 你 眼中 看似 落叶 纷飞 变化无常 的 世界 ， 实际 只是 躺 在 上帝 怀中 一份 早已 谱 好 的 乐章 。 抱歉 ， 这 不是 一句 鸡汤 文 ， 而是 黑板 上 确凿 的 公式 ： 傅里叶 同学 告诉 我们 ， 任何 周期函数 ， 都 可以 看作 是 不同 振幅 ， 不同 相位 正弦波 的 叠加 。 在 第一个 例子 里 我们 可以 理解 为 ， 利用 对 不同 琴键 不同 力度 ， 不同 时间 点 的 敲击 ， 可以 组合 出 任何 一首 乐曲 。 而 贯穿 时域 与 频域 的 方法 之一 ， 就是 传中 说 的 傅里叶 分析 。 傅里叶 分析 可 分为 傅里叶 级数 （Fourier Serie） 和 傅里叶 变换 （Fourier Transformation）， 我们 从 简单 的 开始 谈起 。 二 、 傅里叶 级数 （Fourier Series） 的 频谱 还是 举 个 栗子 并且 有 图 有 真相 才 好 理解 。 如果 我 说 我 能 用 前面 说 的 正弦曲线 波 叠加 出 一个 带  90  度角 的 矩形 波 来 ， 你 会 相信 吗 ？ 你 不会 ， 就 像 当年 的 我 一样 。 但是 看看 下图 ： 第一幅 图 是 一个 郁闷 的 正弦波  cos（x） 第二幅 图 是  2  个 卖 萌 的 正弦波 的 叠加  cos(x)+a.cos(3x) 第三幅 图 是  4  个 发春 的 正弦波 的 叠加 第四幅 图 是  10  个 便秘 的 正弦波 的 叠加 随着 正弦波 数量 逐渐 的 增长 ， 他们 最终 会 叠加 成 一个 标准 的 矩形 ， 大家 从中 体会 到 了 什么 道理 ？（ 只要 努力 ， 弯 的 都 能 掰 直 ！） 随着 叠加 的 递增 ， 所有 正弦波 中 上升 的 部分 逐渐 让 原本 缓慢 增加 的 曲线 不断 变 陡 ， 而 所有 正弦波 中 下降 的 部分 又 抵消 了 上升 到 最高处 时 继续 上升 的 部分 使 其 变为 水平线 。 一个 矩形 就 这么 叠加 而 成 了 。 但是 要 多少 个 正弦波 叠加 起来 才能 形成 一个 标准  90  度角 的 矩形 波 呢 ？ 不幸 的 告诉 大家 ， 答案 是 无穷 多个 。（ 上帝 ： 我 能 让 你们 猜 着 我 ？） 不仅仅 是 矩形 ， 你 能 想到 的 任何 波形 都 是 可以 如此 方法 用 正弦波 叠加 起来 的 。 这 是 没有 接触 过 傅里叶 分析 的 人 在 直觉 上 的 第一个 难点 ， 但是 一旦 接受 了 这样 的 设定 ， 游戏 就 开始 有意思 起来 了 。 还是 上 图 的 正弦波 累加 成 矩形 波 ， 我们 换 一个 角度 来 看看 ： 在 这 几幅 图 中 ， 最 前面 黑色 的 线 就是 所有 正弦波 叠加 而 成 的 总和 ， 也 就是 越来越 接近 矩形 波 的 那个 图形 。 而 后面 依 不同 颜色 排列 而 成 的 正弦波 就是 组合 为 矩形 波 的 各个 分量 。 这些 正弦波 按照 频率 从 低 到 高 从前 向 后 排列 开来 ， 而 每 一个 波 的 振幅 都 是 不同 的 。 一定 有 细心 的 读者 发现 了 ， 每 两个 正弦波 之间 都 还有 一条 直线 ， 那 并 不是 分割线 ， 而是 振幅 为  0  的 正弦波 ！ 也就是说 ， 为了 组成 特殊 的 曲线 ， 有些 正弦波 成分 是 不 需要 的 。 这里 ， 不同 频率 的 正弦波 我们 成为 频率 分量 。 好 了 ， 关键 的 地方 来 了 ！！ 如果 我们 把 第一个 频率 最低 的 频率 分量 看作 “1”， 我们 就 有 了 构建 频域 的 最 基本 单元 。 对于 我们 最 常见 的 有理数 轴 ， 数字 “1” 就是 有理数 轴 的 基本 单元 。 时域 的 基本 单元 就是 “1  秒 ”， 如果 我们 将 一个 角频率 为 $/omega0$ 的 正弦波  cos($/omega0$) 看作 基础 ， 那么 频域 的 基本 单元 就是 $/omega_0$。 有 了 “1”， 还要 有 “0” 才能 构成 世界 ， 那么 频域 的 “0” 是 什么 呢 ？cos（0t） 就是 一个 周期 无限 长 的 正弦波 ， 也 就是 一条 直线 ！ 所以 在 频域 ，0  频率 也 被 称为 直流 分量 ， 在 傅里叶 级数 的 叠加 中 ， 它 仅仅 影响 全部 波形 相对 于 数轴 整体 向上 或是 向下 而 不 改变 波 的 形状 。 接下来 ， 让 我们 回到 初中 ， 回忆 一下 已经 死去 的 八戒 ， 啊 不 ， 已经 死去 的 老师 是 怎么 定义 正弦波 的 吧 。 正弦波 就是 一个 圆周运动 在 一条 直线 上 的 投影 。 所以 频域 的 基本 单元 也 可以 理解 为 一个 始终 在 旋转 的 圆 介绍 完 了 频域 的 基本 组成 单元 ， 我们 就 可以 看一看 一个 矩形 波 ， 在 频域 里 的 另 一个 模样 了 ： 这 是 什么 奇怪 的 东西 ？ 这 就是 矩形 波 在 频域 的 样子 ， 是不是 完全 认不出来 了 ？ 教科书 一般 就 给 到 这里 然后 留给 了 读者 无穷的 遐想 ， 以及 无穷的 吐 槽 ， 其实 教科书 只要 补 一张 图 就 足够 了 ： 频域 图像 ， 也 就是 俗称 的 频谱 ， 就是 —— 再 清楚 一点 ： 可以 发现 ， 在 频谱 中 ， 偶数 项 的 振幅 都 是  0， 也 就 对应 了 图 中 的 彩色 直线 。 振幅 为  0  的 正弦波 。 老实 说 ， 在 我 学 傅里叶 变换 时 ， 维基 的 这个 图 还 没有 出现 ， 那时 我 就 想到 了 这种 表达方法 ， 而且 ， 后面 还 会 加入 维基 没有 表示 出来 的 另 一个 谱 —— 相位 谱 。 但是 在 讲 相位 谱 之前 ， 我们 先 回顾 一下 刚刚 的 这个 例子 究竟 意味着 什么 。 记得 前面 说 过 的 那 句 “ 世界 是 静止 的 ” 吗 ？ 估计 好多 人 对 这 句 话 都 已经 吐 槽 半天 了 。 想象 一下 ， 世界 上 每 一个 看似 混乱 的 表象 ， 实际 都 是 一条 时间轴 上 不规则 的 曲线 ， 但 实际 这些 曲线 都 是 由 这些 无穷无尽 的 正弦波 组成 。 我们 看似 不 规律 的 事情 反而 是 规律 的 正弦波 在 时域 上 的 投影 ， 而 正弦波 又 是 一个 旋转 的 圆 在 直线 上 的 投影 。 那么 你 的 脑海中 会 产生 一个 什么 画面 呢 ？ 我们 眼中 的 世界 就 像 皮影戏 的 大 幕布 ， 幕布 的 后面 有 无数 的 齿轮 ， 大 齿轮 带动 小齿轮 ， 小齿轮 再 带动 更 小 的 。 在 最 外面 的 小齿轮 上 有 一个 小人 —— 那 就是 我们 自己 。 我们 只 看到 这个 小人 毫无 规律 的 在 幕布 前 表演 ， 却 无法 预测 他 下 一步 会 去 哪 。 而 幕布 后面 的 齿轮 却 永远 一直 那样 不停 的 旋转 ， 永不 停歇 。 这样 说来 有些 宿命论 的 感觉 。 说实话 ， 这种 对 人生 的 描绘 是 我 一个 朋友 在 我们 都 是 高中生 的 时候 感叹 的 ， 当时 想想 似懂非懂 ， 直到 有 一天 我 学到 了 傅里叶 级数 …… 三 、 傅里叶 级数 （Fourier Series） 的 相位 谱 上 一章 的 关键词 是 ： 从 侧面 看 。 这 一章 的 关键词 是 ： 从 下面 看 。 在 这 一章 最 开始 ， 我 想 先 回答 很多 人 的 一个 问题 ： 傅里叶 分析 究竟 是 干什么 用 的 ？ 这 段 相对 比较 枯燥 ， 已经 知道 了 的 同学 可以 直接 跳 到 下 一个 分割线 。 先 说 一个 最 直接 的 用途 。 无论 听 广播 还是 看电视 ， 我们 一定 对 一个 词 不 陌生 —— 频道 。 频道 频道 ， 就是 频率 的 通道 ， 不同 的 频道 就是 将 不同 的 频率 作为 一个 通道 来 进行 信息 传输 。 下面 大家 尝试 一件 事 ： 先 在 纸 上 画 一个  sin（x）， 不 一定 标准 ， 意思 差不多 就 行 。 不是 很 难 吧 。 好 ， 接下去 画 一个  sin（3x）+sin（5x） 的 图形 。 别说 标准 不 标准 了 ， 曲线 什么 时候 上升 什么 时候 下降 你 都 不 一定 画 的 对 吧 ？ 好 ， 画 不 出来 不要紧 ， 我 把  sin（3x）+sin（5x） 的 曲线 给 你 ， 但是 前提 是 你 不 知道 这个 曲线 的 方程式 ， 现在 需要 你 把  sin（5x） 给 我 从 图里 拿出 去 ， 看看 剩下 的 是 什么 。 这 基本 是 不 可能 做到 的 。 但是 在 频域 呢 ？ 则 简单 的 很 ， 无非 就是 几条 竖线 而已 。 所以 很多 在 时域 看似 不 可能 做到 的 数学 操作 ， 在 频域 相反 很 容易 。 这 就是 需要 傅里叶 变换 的 地方 。 尤其 是从 某 条 曲线 中 去除 一些 特定 的 频率 成分 ， 这 在 工程 上 称为 滤波 ， 是 信号处理 最 重要 的 概念 之一 ， 只有 在 频域 才能 轻松 的 做到 。 再说 一个 更 重要 ， 但是 稍微 复杂 一点 的 用途 —— 求解 微分方程 。（ 这 段 有点 难度 ， 看不懂 的 可以 直接 跳 过 这 段 ） 微分方程 的 重要性 不用 我 过 多 介绍 了 。 各行各业 都 用 的 到 。 但是 求解 微分方程 却是 一件 相当 麻烦 的 事情 。 因为 除了 要 计算 加减乘除 ， 还要 计算 微分 积分 。 而 傅里叶 变换 则 可以 让 微分 和 积分 在 频域 中 变为 乘法 和 除法 ， 大学 数学 瞬间 变 小学 算术 有没有 。 傅里叶 分析 当然 还有 其他 更 重要 的 用途 ， 我们 随着 讲 随着 提 。 下面 我们 继续 说 相位 谱 ： 通过 时域 到 频域 的 变换 ， 我们 得到 了 一个 从 侧面 看 的 频谱 ， 但是 这个 频谱 并 没有 包含 时域 中 全部 的 信息 。 因为 频谱 只 代表 每 一个 对应 的 正弦波 的 振幅 是 多少 ， 而 没有 提到 相位 。 基础 的 正弦波  A.sin($/omega$t+θ) 中 ， 振幅 ， 频率 ， 相位 缺一不可 ， 不同 相位 决定 了 波 的 位置 ， 所以 对于 频域 分析 ， 仅仅 有 频谱 （ 振幅 谱 ） 是 不够 的 ， 我们 还 需要 一个 相位 谱 。 那么 这个 相位 谱 在 哪 呢 ？ 我们 看 下图 ， 这次 为了 避免 图片 太 混 论 ， 我们 用  7  个 波 叠加 的 图 。 鉴于 正弦波 是 周期 的 ， 我们 需要 设定 一个 用来 标记 正弦波 位置 的 东西 。 在 图 中 就是 那些 小红点 。 小红点 是 距离 频率 轴 最近 的 波峰 ， 而 这个 波峰 所 处 的 位置 离 频率 轴 有 多 远 呢 ？ 为了 看 的 更 清楚 ， 我们 将 红色 的 点 投影 到 下 平面 ， 投影 点 我们 用 粉色 点 来 表示 。 当然 ， 这些 粉色 的 点 只 标注 了 波峰 距离 频率 轴 的 距离 ， 并 不是 相位 。 这里 需要 纠正 一个 概念 ： 时间差 并 不是 相位差 。 如果 将 全部 周期 看作  2Pi  或者  360  度 的话 ， 相位差 则 是 时间差 在 一个 周期 中 所 占 的 比例 。 我们 将 时间差 除 周期 再 乘 2$/pi$， 就 得到 了 相位差 。 在 完整 的 立体图 中 ， 我们 将 投影 得到 的 时间差 依次 除以 所在 频率 的 周期 ， 就 得到 了 最 下面 的 相位 谱 。 所以 ， 频谱 是从 侧面 看 ， 相位 谱 是从 下面 看 。 下次 偷看 女生 裙 底 被 发现 的话 ， 可以 告诉 她 ：“ 对不起 ， 我 只是 想 看看 你 的 相位 谱 。” 注意 到 ， 相位 谱 中 的 相位 除了 0， 就是 $/pi$。 因为  cos（t+$/pi$）=-cos（t）， 所以 实际上 相位 为 $/pi$ 的 波 只是 上下 翻转 了 而已 。 对于 周期 方波 的 傅里叶 级数 ， 这样 的 相位 谱 已经 是 很 简单 的 了 。 另外 值得注意 的 是 ， 由于  cos（t+2$/pi$）=cos（t）， 所以 相位差 是 周期 的 ，$/pi$ 和  3$/pi$，5$/pi$，7$/pi$ 都 是 相同 的 相位 。 人为 定义 相位 谱 的 值域 为 (-$/pi$，$/pi$)， 所以 图 中 的 相位差 均 为 $/pi$。 最后 来 一张 大 集合 ： 四 、 傅里叶 变换 （Fourier Transformation） 相信 通过 前面 三章 ， 大家 对 频域 以及 傅里叶 级数 都 有 了 一个 全新 的 认识 。 但是 文章 在 一 开始 关于 钢琴 琴谱 的 例子 我 曾 说 过 ， 这个 栗子 是 一个 公式 错误 ， 但是 概念 典型 的 例子 。 所谓 的 公式 错误 在 哪里 呢 ？ 傅里叶 级数 的 本质 是 将 一个 周期 的 信号 分解成 无限 多 分开 的 （ 离散 的 ） 正弦波 ， 但是 宇宙 似乎 并 不是 周期 的 。 曾经 在 学 数字 信号处理 的 时候 写 过 一首 打油诗 ： 往昔 连续 非 周期 回忆 周期 不 连续 任 你  ZT、DFT 还原 不 回去 （ 请 无视 我 渣 一样 的 文学 水平 ……) 在 这个 世界 上 ， 有 的 事情 一期 一会 ， 永不 再 来 ， 并且 时间 始终 不曾 停息 地 将 那些 刻骨铭心 的 往昔 连续 的 标记 在 时间 点 上 。 但是 这些 事情 往往 又 成为 了 我们 格外 宝贵 的 回忆 ， 在 我们 大脑 里 隔 一段时间 就 会 周期性 的 蹦出来 一下 ， 可惜 这些 回忆 都 是 零散 的 片段 ， 往往 只有 最 幸福 的 回忆 ， 而 平淡 的 回忆 则 逐渐 被 我们 忘却 。 因为 ， 往昔 是 一个 连续 的 非 周期 信号 ， 而 回忆 是 一个 周期 离散 信号 。 是否 有 一种 数学 工具 将 连续 非 周期 信号 变换 为 周期 离散 信号 呢 ？ 抱歉 ， 真 没有 。 比如 傅里叶 级数 ， 在 时域 是 一个 周期 且 连续 的 函数 ， 而 在 频域 是 一个 非 周期 离散 的 函数 。 这 句 话 比较 绕嘴 ， 实在 看着 费事 可以 干脆 回忆 第一章 的 图片 。 而 在 我们 接下去 要 讲 的 傅里叶 变换 ， 则 是 将 一个 时域 非 周期 的 连续 信号 ， 转换 为 一个 在 频域 非 周期 的 连续 信号 。 算了 ， 还是 上 一张 图 方便 大家 理解 吧 ： 或者 我们 也 可以 换 一个 角度 理解 ： 傅里叶 变换 实际上 是 对 一个 周期 无限大 的 函数 进行 傅里叶 变换 。 所以 说 ， 钢琴谱 其实 并非 一个 连续 的 频谱 ， 而是 很多 在 时间 上 离散 的 频率 ， 但是 这样 的 一个 贴切 的 比喻 真的 是 很 难 找出 第二个 来 了 。 因此 在 傅里叶 变换 在 频域 上 就 从 离散谱 变成 了 连续谱 。 那么 连续谱 是 什么 样子 呢 ？ 你 见 过 大海 么 ？ 为了 方便 大家 对比 ， 我们 这次 从 另 一个 角度 来看 频谱 ， 还是 傅里叶 级数 中 用到 最 多 的 那幅 图 ， 我们 从 频率 较 高 的 方向 看 。 以上 是 离散谱 ， 那么 连续谱 是 什么 样子 呢 ？ 尽情 的 发挥 你 的 想象 ， 想象 这些 离散 的 正弦波 离 得 越来越近 ， 逐渐 变得 连续 …… 直到 变得 像 波涛起伏 的 大海 ： 很 抱歉 ， 为了 能 让 这些 波浪 更 清晰 的 看到 ， 我 没有 选用 正确 的 计算 参数 ， 而是 选择 了 一些 让 图片 更 美观 的 参数 ， 不然 这 图 看起来 就 像 屎 一样 了 。 不过 通过 这样 两幅 图 去 比较 ， 大家 应该 可以 理解 如何 从 离散谱 变成 了 连续谱 的 了 吧 ？ 原来 离散谱 的 叠加 ， 变成 了 连续谱 的 累积 。 所以 在 计算 上 也 从 求和 符号 变成 了 积分 符号 。 不过 ， 这个 故事 还 没有 讲完 ， 接下去 ， 我 保证 让 你 看到 一幅 比 上 图 更 美丽 壮观 的 图片 ， 但是 这里 需要 介绍 到 一个 数学 工具 才能 然 故事 继续 ， 这个 工具 就是 —— 五 、 宇宙 耍 帅 第一 公式 ： 欧拉 公式 虚数  i  这个 概念 大家 在 高中 就 接触 过 ， 但 那时 我们 只 知道 它 是 -1  的 平方根 ， 可是 它 真正 的 意义 是 什么 呢 ? 这里 有 一条 数轴 ， 在 数轴 上 有 一个 红色 的 线段 ， 它 的 长度 是  1。 当 它 乘以  3  的 时候 ， 它 的 长度 发生 了 变化 ， 变成 了 蓝色 的 线段 ， 而 当 它 乘以 -1  的 时候 ， 就 变成 了 绿色 的 线段 ， 或者说 线段 在 数轴 上 围绕 原点 旋转 了  180  度 。 我们 知道 乘 -1  其实 就是 乘 了 两次  i  使 线段 旋转 了  180  度 ， 那么 乘 一次 $i$ 呢 —— 答案 很 简单 —— 旋转 了  90  度 。 同时 ， 我们 获得 了 一个 垂直 的 虚数 轴 。 实数 轴 与 虚数 轴 共同 构成 了 一个 复数 的 平面 ， 也 称 复 平面 。 这样 我们 就 了解 到 ， 乘虚 数  i  的 一个 功能 —— 旋转 。 现在 ， 就 有 请 宇宙 第一 耍 帅 公式 欧拉 公式 隆重 登场 ——$$e^{ix}=cosx+isinx$$ 这个 公式 在 数学 领域 的 意义 要 远大于 傅里叶 分析 ， 但是 乘 它 为 宇宙 第一 耍 帅 公式 是因为 它 的 特殊 形式 —— 当 $x$ 等于 $/pi$ 的 时候 。$$e^{i/pi}+1=0$$ 经常 有 理工科 的 学生 为了 跟 妹子 表现 自己 的 学术 功底 ， 用 这个 公式 来 给 妹子 解释 数学 之 美 ：” 石榴 姐 你 看 ， 这个 公式 里 既有 自然 底数  e， 自然数  1  和  0， 虚数  i  还有 圆周率 $/pi$， 它 是 这么 简洁 ， 这么 美丽 啊 ！“ 但是 姑娘 们 心里 往往 只有 一句 话 ：” 臭 屌丝 ……“ 这个 公式 关键 的 作用 ， 是 将 正弦波 统一 成 了 简单 的 指数 形式 。 我们 来 看看 图像 上 的 涵义 ： 欧拉 公式 所 描绘 的 ， 是 一个 随着 时间 变化 ， 在 复 平面 上 做 圆周运动 的 点 ， 随着 时间 的 改变 ， 在 时间轴 上 就 成 了 一条 螺旋线 。 如果 只 看 它 的 实数 部分 ， 也 就是 螺旋线 在 左侧 的 投影 ， 就是 一个 最 基础 的 余弦 函数 。 而 右侧 的 投影 则 是 一个 正弦 函数 。 关于 复数 更深 的 理解 ， 大家 可以 参考 ： 复数 的 物理 意义 是 什么 这里 不 需要 讲 的 太 复杂 ， 足够 让 大家 理解 后面 的 内容 就 可以 了 。 六 、 指数 形式 的 傅里叶 变换 有 了 欧拉 公式 的 帮助 ， 我们 便 知道 ： 正弦波 的 叠加 ， 也 可以 理解 为   螺旋线 的 叠加   在 实数 空间 的 投影 。 而 螺旋线 的 叠加 如果 用 一个 形象 的 栗子 来 理解 是 什么 呢 ？ 光波 高中 时 我们 就学 过 ， 自然光 是 由 不同 颜色 的 光 叠加 而 成 的 ， 而 最 著名 的 实验 就是 牛顿 师傅 的 三棱镜 实验 ： 所以 其实 我们 在 很 早就 接触 到 了 光 的 频谱 ， 只是 并 没有 了解 频谱 更 重要 的 意义 。 但 不同 的 是 ， 傅里叶 变换 出来 的 频谱 不仅仅 是 可见光 这样 频率 范围 有限 的 叠加 ， 而是 频率 从  0  到 无穷 所有 频率 的 组合 。 这里 ， 我们 可以 用 两种 方法 来 理解 正弦波 ： 第一种 前面 已经 讲 过 了 ， 就是 螺旋线 在 实 轴 的 投影 。 另 一种 需要 借助 欧拉 公式 的 另 一种 形式 去 理解 ：$$e^{i/pi}=cos(t)+isin(t)$$$$e^{-i/pi}=cos(t)-isin(t)$$ 将 以上 两 式 相加 再 除  2， 得到 ：$$cos(t)=/frac{e^{it}+e^{-it}}{2}$$ 这个 式子 可以 怎么 理解 呢 ？ 我们 刚才 讲 过 ，$e^{it}$ 可以 理解 为 一条 逆时针 旋转 的 螺旋线 ， 那么 $e^{-it}$ 则 可以 理解 为 一条 顺时针 旋转 的 螺旋线 。 而  cos(t) 则 是 这 两条 旋转 方向不同 的 螺旋线 叠加 的 一半 ， 因为 这 两条 螺旋线 的 虚数 部分 相互 抵消 掉 了 ！ 举 个 例子 的话 ， 就是 极化 方向不同 的 两束 光波 ， 磁场 抵消 ， 电场 加倍 。 这里 ， 逆时针 旋转 的 我们 称为 正 频率 ， 而 顺时针 旋转 的 我们 称为 负 频率 （ 注意 不是 复频率 ）。 好 了 ， 刚才 我们 已经 看到 了 大海 —— 连续 的 傅里叶 变换 频谱 ， 现在 想一想 ， 连续 的 螺旋线 会 是 什么 样子 ： 想象 一下 再 往 下 翻 ：||||||||| 是不是 很漂亮 ？ 你 猜猜 ， 这个 图形 在 时域 是 什么 样子 ？ 哈哈 ， 是不是 觉得 被 狠狠 扇 了 一个 耳光 。 数学 就是 这么 一个 把 简单 的 问题 搞 得 很 复杂 的 东西 。 顺便 说 一句 ， 那个 像 大 海螺 一样 的 图 ， 为了 方便 观看 ， 我 仅仅 展示 了 其中 正 频率 的 部分 ， 负 频率 的 部分 没有 显示 出来 。 如果 你 认真 去 看 ， 海螺 图 上 的 每 一条 螺旋线 都 是 可以 清楚 的 看到 的 ， 每 一条 螺旋线 都 有着 不同 的 振幅 （ 旋转 半径 ）， 频率 （ 旋转 周期 ） 以及 相位 。 而 将 所有 螺旋线 连成 平面 ， 就是 这 幅 海螺 图 了 。 好 了 ， 讲 到 这里 ， 相信 大家 对 傅里叶 变换 以及 傅里叶 级数 都 有 了 一个 形象 的 理解 了 ， 我们 最后 用 一张 图 来 总结 一下 ： 好 了 ， 傅里叶 的 故事 终于 讲完 了 ， 下面 来 讲讲 我 的 故事 ： 这 篇文章 第一次 被 写 下来 的 地方 你们 绝对 猜 不到 在 哪 ， 是 在 一张 高 数 考试 的 卷子 上 。 当时 为了 刷 分 ， 我 重修 了 高 数 （ 上 ）， 但是 后来 时间 紧 压根 没 复习 ， 所以 我 就 抱 着 裸 考 的 心态 去 了 考场 。 但是 到 了 考场 我 突然 意识 到 ， 无论如何 我 都 不会 比 上次 考 的 更好 了 ， 所以 干脆 写 一些 自己 对于 数学 的 想法 吧 。 于是 用 了 一个 小时 左右 的 时间 在 试卷 上 洋洋洒洒 写 了 本文 的 第一 草稿 。 你们 猜 我 的 了 多少 分 ？6  分 没错 ， 就是 这个 数字 。 而 这  6  分 的 成绩 是因为 最后 我 实在 无聊 ， 把 选择题 全部 填 上 了  C， 应该 是 中 了 两道 ， 得到 了 这 宝贵 的  6  分 。 说真的 ， 我 很 希望 那 张 卷子 还 在 ， 但是 应该 不太可能 了 。 那么 你们 猜猜 我 第一次 信号 与 系统 考 了 多少 分 呢 ？45  分 没错 ， 刚刚 够 参加 补考 的 。 但是 我心 一 横 没 去 考 ， 决定 重修 。 因为 那个 学期 在 忙 其他 事情 ， 学习 真的 就 抛 在 脑 后 了 。 但是 我 知道 这 是 一门 很 重要 的 课 ， 无论如何 我 要 吃透 它 。 说真的 ， 信号 与 系统 这 门 课 几乎 是 大部分 工科 课程 的 基础 ， 尤其 是 通信 专业 。 在 重修 的 过程 中 ， 我 仔细分析 了 每 一个 公式 ， 试图 给 这个 公式 以 一个 直观 的 理解 。 虽然 我 知道 对于 研究 数学 的 人 来说 ， 这样 的 学习 方法 完全 没有 前途 可言 ， 因为 随着 概念 愈加 抽象 ， 维度 越来越 高 ， 这种 图像 或者 模型 理解 法 将 完全 丧失 作用 。 但是 对于 一个 工科 生 来说 ， 足够 了 。 后来 来 了 德国 ， 这边 学校 要求 我 重修 信号 与 系统 时 ， 我 彻底 无 语 了 。 但是 没 办法 ， 德国人 有时 对 中国 人 就是 有种 藐视 ， 觉得 你 的 教育 不靠 谱 。 所以 没 办法 ， 再 来 一遍 吧 。 这次 ， 我 考 了 满分 ， 而 及格率 只有 一半 。 老实 说 ， 数学 工具 对于 工科 生 和 对于 理科生 来说 ， 意义 是 完全 不同 的 。 工科 生 只要 理解 了 ， 会 用 ， 会 查 ， 就 足够 了 。 但是 很多 高校 却 将 这些 重要 的 数学课程 教给 数学系 的 老师 去 教 。 这样 就 出现 一个 问题 ， 数学老师 讲 得 天花乱坠 ， 又 是 推理 又 是 证明 ， 但是 学生 心里 就 只有 一句 话 ： 学 这 货 到底 干嘛 用 的 ？ 缺少 了 目标 的 教育 是 彻底 的 失败 。 在 开始 学习 一门 数学 工具 的 时候 ， 学生 完全 不 知道 这个 工具 的 作用 ， 现实 涵义 。 而 教材 上 有 只有 晦涩 难懂 ， 定语 就 二十几个 字 的 概念 以及 看 了 就 眼晕 的 公式 。 能 学 出 兴趣 来 就 怪 了 ！ 好 在 我 很 幸运 ， 遇到 了 大连海事大学 的 吴 楠 老师 。 他 的 课 全程 来看 是 两条 线索 ， 一条 从 上 而 下 ， 一条 从 下 而 上 。 先 讲 本 门 课程 的 意义 ， 然后 指出 这 门 课程 中 会 遇到 哪样 的 问题 ， 让 学生 知道 自己 学习 的 某种 知识 在 现实 中 扮演 的 角色 。 然后 再 从 基础 讲 起 ， 梳理 知识 树 ， 直到 延伸 到 另 一条 线索 中 提出 的 问题 ， 完美 的 衔接 在 一起 ！ 这样 的 教学模式 ， 我 想 才 是 大学 里 应该 出现 的 。 最后 ， 写给 所有 给 我 点 赞 并 留言 的 同学 。 真的 谢谢 大家 的 支持 ， 也 很 抱歉 不能 一一 回复 。 因为 知 乎 专栏 的 留言 要 逐次 加载 ， 为了 看到 最后 一条 要点 很 多次 加载 。 当然 我 都 坚持 看 完 了 ， 只是 没 办法 一一 回复 。 本文 只是 介绍 了 一种 对 傅里叶 分析 新颖 的 理解 方法 ， 对于 求学 ， 还是 要 踏踏实实 弄清楚 公式 和 概念 ， 学习 ， 真的 没有 捷径 。 但 至少 通过 本文 ， 我 希望 可以 让 这 条 漫长 的 路 变得 有意思 一些 。 最后 ， 祝 大家 都 能 在 学习 中 找到 乐趣 。…","title":" 快速 理解 「 傅里叶 」 分析 ","oriTitle":"快速理解「傅里叶」分析"},{"uri":"https://redblue.ga/knowleges/_index","tags":[],"content":"+++linktitle = \" 学识 \"title = \" 学而不思 则 罔 ， 思 而 不 学 则 殆 \"description = \" 框架 先于 本质 \"layout=\"list\"+++"}]