[{"uri":"https://redblue.ga/spirits/thinking/18-tomb-sweeping","tags":[],"content":"—— 北宋 王 禹 偁 《 清明 》>>  无 花 无 酒 过 清明 ， 兴味 萧然 似 野 僧 。>  昨日 邻家 乞 新 火 ， 晓 窗 分 与 读书 灯 。 清明 ， 总 有 被 遗忘 的 人 。 千年 前 的 清明 ， 王 禹 偁 一个 人 ， 无 花 ， 无 酒 。 这样 的 清平 淡漠 ， 不 正像 极了 那 舍 却 世俗 在 四处 化缘 的 僧侣 。 但 僧 者 虽 无 所 安 ， 却 不 忘 参 得 佛 道 。 那么 在 这 清明 时节 ， 应当 也 不 忘 求得 真知 ， 恰好 用 这 无人 打扰 的 时间 治学 。 于是 ， 向 邻 友 家 拿 得 些 火种 ， 想要 在 清明节 人们 还 未 醒来 忙 做 的 时候 ， 坐在 窗前 ， 点亮 芯 灯 ， 潜心 读书 。 此时 的 我 ， 即 是 平行 世界 里 的 王 禹 偁 。 身处 异乡 ， 无 亲人 可 祭拜 。 想 去 烈士陵园 扫墓 ， 奈何 甚远 ， 只能 将 所有 的 念 想 折 成 白花 ， 挂 在 窗前 ， 希望 我 所 念 的 人 还有 孤独 的 逝者 能 看得见 这 朵 遥远 而 孤独 的 花 。 我 是 一个 活着 的 人 ， 却 和 那些 已经 没有 人 祭奠 的 逝者 一样 ， 被 人 遗忘 。 这 两年 来 ， 学习 失意 ， 兴趣 失意 ， 生活 失意 ， 感情 失意 。 好像 到 了 人生 最 艰难 的 时刻 ， 压力 来自 父母 ， 来自 族 系 ， 来自 学校 ， 来自 社会 ， 源自 自己 。 伪装 的 独立 ， 早已 拿来 独自 抵抗 心 的 冷 。 人 与 人 泛泛之交 而 非 君子之交 ， 小人 得势 。 自己 却 沉 于 浮躁 ， 自 乱 阵脚 。 又 落 个 无形 的 套子 ， 迈 不 出去 。 无 球友 ， 无 道友 ， 无 心思 。 敏感 孤 援 ， 纵 有 万种风情 以及 深海 苦水 ， 又 与 何人 说 。 想要 抛开 一切 得 洒脱 ， 读书 、 思考 、 写作 均 是 自赎 。 于是 ， 写 得 此文 ， 借 清明 ， 调整 状态 ， 继续 明天 。 其实 ， 我 只是 自己 暂时 迷路 了 而已 。>  你 还好 吗 >>  我 还 算 好 >>  要说 的 ， 相信 他们 已 与 你 说 过 >>  我 心里 的 ， 折 在 这 白花 里 >>  愿 随风 而 起 ， 随风而去 ， 随风 而 落 >>  念 的 ， 想 的 ， 你 全都 看得见 ","title":" 再 清明 ， 似 「 野 僧 」","oriTitle":"再清明，似「野僧」"},{"uri":"https://redblue.ga/spirits/thinking/fast-culture","tags":[],"content":" 快餐 --1999 年 ， 我 第一次 吃 麦当劳 。 在 那个 中午 ， 金黄 酥脆 的 外表 和 恰到好处 的 调味 一下子 征服 了 我 。 更 能 让 一个 小孩子 感到 惊奇 的 是 ： 我 站 在 柜台 前面 ， 用 手指 一 指 ， 图片 里 的 东西 就 能 马上 递 到 我 手上 。 晚上 妈妈 烧 了 两个 小时 的 菜 ， 端 上桌 来 唤 我 吃饭 。 我 却 爬 到 饭桌 前 对 爷爷 说 ：“ 我 要 吃 麦当劳 ！ 多 快 多 方便 ！” 妈妈 听 了 眉头一皱 ：“ 洋垃圾 ， 尝个 鲜儿 得 了 ， 还 能 顶 饭 吃 ？” 我 扭过头 说 ：“ 等 我 长大 了 就 把 它 当 饭 吃 。” 现在 我 真的 把 它 当 饭 吃 了 ， 虽然 味同嚼蜡 。 我 在 深圳 的 无数个 夜晚 ， 梦 中 憧憬 着 妈妈 站 在 油烟 缭绕 的 厨房 里 ， 一遍 又 一遍 翻炒 着 我 爱 吃 的 排骨 ， 醒来 发现自己 嘴角 濡 水 ， 眼角 含泪 。 有人 说 互联网 才 是 快 文化 的 源头 ， 可 我 看来 快餐 似乎 更 早 。 到 现在 ， 人类 已经 离不开 快 文化 了 。 城市 -- 所有 的 城市 都 是 香港 的 复刻版 ， 在 钢筋水泥 和 玻璃幕墙 间 ， 透出 一小片 视觉 失谐 的 “ 老街 ” 供 人 凭吊 。 纯色 T 恤 搭 着 牛仔裤 “ 老街 ” 里 穿梭 。 偶尔 路过 一两个 名人 故居 ， 拿 起 手机 跟 雕像 合 几张 影 ， 再 百度 一句 他 说 过 的 名言 po 到 朋友圈 上 静静地 等 赞 。 走 的 累 了 可以 去 路边 店 点 两份 号称 “ 乾隆 下 江南 赞不绝口 ”、“ 毛主席 念念不忘 ” 的 小吃 。 等 菜 的 时候 刷刷 微 博 知 乎 ， 看见 某个 段子 手 在 抖 机灵 接着 会心一笑 顺手 点 个 赞 。 好 了 ， 这个 城市 我 来 过 。 在 这么 个 崇拜 快节奏 的 年代 ， 你 凭 什么 不让 我 简单 至死 ？ 信息时代 日子 过 得 真是 好 快 ， 我 打开 手机 应用 就 找 得到 所有 信息 。 我 甚至 懒得 去 找 ， 更 懒得 去 想 自己 该 找 什么 。 我 奉行 极 简 主义 ， 我 只 为了 我 少 的 可怜 的 兴趣 抬抬 眼皮 。 于是 ， 我 不 知道 时间 在 城乡 方言 里 刻下 的 烙印 ， 我 不 关心 谁 在 这 座 凉亭 里 写 过 美妙 诗文 ， 我 看不见 田野 里 冰雪 随着 春天 消融 ， 我 听不见 微风 扫 过 竹林 的 空寂 宁静 。 我 只 关心 大 V、Taylor Swift 和 淘宝 。So what？I’m the bloody Fashionistas! 快 文化 快 文化 在 时 下 越来越 流行 ， 而 它 的 出现 是 必然 的 。 互联网 时代 的 信息 爆炸 对 人们 的 信息 读取 吸收能力 产生 了 干扰 ， 并 加剧 了 人们 的 选择 困难 。 再有 ， 人类 的 本性 是 懒惰 ， 刻苦钻研 对 体力 的 消耗 是 巨大 的 。 并且 ， 快 文化 一般 伴随 着 反 智 主义 共同 流行 。 人们 更 习惯于 关注 屋檐 的 高度 ， 而 忽视 坚实 的 地基 。 许多 反 智 主义者 强调 马 云 毕业 于 三本 学校 ， 却 选择性 忽视 他 优秀 的 英语 帮助 他 到 美国 开拓 视野 打下 的 基础 。 浮躁 的 不 只是 中国 社会 ， 日本 学者 大 前 研 一 在 他 的 著作 《 低 智商 社会 》 中 这样 描述 当下 的 日本 民众 ：“ 不 进行 深入 思考 ， 盲目 地 赶时髦 。”“ 对于 韩国 和 中国 的 问题 ， 本能 地 持有 情绪化 的 ‘ 观点 。”“ 也许 那些 经济 报纸 的 记者 都 是 专家 吧 ， 所以 他们 写 的 消息 也 都 是 正确 的 。”“ 电视节目 里 清一色 的 “ 综艺节目 ” 和 “ 笑话 ”， 有助于 日本 文化 的 提升 。”“ 对于 中国 、 韩国 、 印度 经济 飞跃发展 的 话题 ， 已经 感到 厌烦 。”“ 盛田昭 夫 后继无人 并 不是 什么 大事 ， 相比之下 ， 和 那些 金钱至上 的 ‘ 野蛮 国家 ’ 划清界限 才 是 最 重要 的 。” 一种 矛盾 的 情绪 似乎 在 日本 社会 上 蔓延 。 他们 既 是 《 菊 与 刀 》 中 深沉 而 细腻 的 民族 ， 也 是 亚洲 快 文化 的 策源地 。 他们 掌握 着 最 精密 的 尖端 制造 技术 ， 也 缔造 了 优 衣 库 这样 的 快 时尚 服装 巨头 。 在 快 文化 的 阴影 下 ， 他们 恐惧 “ 低 智商 社会 ” 将 在 某 一天 真的 到来 。 读书 -- 仍然 处在 追赶 地位 的 中国 ， 似乎 还 没 意识 到 快 文化 的 负面 作用 。 好几年 前 ， 一份 关于 世界 各国 国民 书籍 阅读 量 的 调查结果 在 网上 疯 传 ， 许多 人 在 惭愧 反思 之 余 ， 在 社交 媒体 上 晒 起 了 书单 ： 发愿 今年 读完 100 本书 。 甚至 有人 扬言 ： 收到 多少 赞 我 今年 就读 多少 本 ！ 天 啊 ， 这 是 冷战 的 军备竞赛 么 ？ 快 文化 中 的 数量 主义 只 负责 制造舆论 需求 ， 其实 它 和 许多 只顾 传播 信息 而 不 考虑 社会 效应 的 媒体 一样 不负责任 。“ 在 书店 里 ， 只 会 拿 起 ‘ 简单 、 有效 、 马上 能 用 上 ’ 的 书 。” 这 就是 大多数 人 对 面对 阅读 的 心态 。 平均 3.65 天 就 能 读完 的 书 ， 我 很 难 认为 这 本书 能 给 我 以 很 高 的 价值 。 在 互联网 时代 信息 共享 已经 大大 削弱 了 书籍 的 信息 载体 功能 ， 信息 价值 几乎 等于零 ， 那么 读书 又 有 什么 价值 呢 ？ 读书 最大 的 好处 就是 ， 可以 让 人 拥有 思辨 力 ， 不会 人云亦云 。 有人 马上 反驳 ： 互联网 上 也 能 读书 啊 ， 下载 TXT 就 能 阅读 了 。 对 ， 你 说 的 没错 。 但是 你 看 么 ？ 思考 -- 你 工作 越来越 忙 ， 除了 刷 微 博 刷 微 信 ， 你 喜欢 抓起 那些 药到病除 的 工具书 ， 随便 一 翻 就 把 问题 搞定 。 忽然 某 一天 你 需要 陶冶情操 了 ， 眼光 马上 投向 那些 被 处理 过 的 二手 知识 。 比如 百家讲坛 、 罗 辑 思维 、 晓 松 奇谈 。 我 不能 否认 二手 知识 的 具有 更 强 的 适用 价值 ， 他 可以 给 你 套 一个 先入为主 的 逻辑 ， 让 你 不知不觉 间 大致 知道 了 整件事 的 来龙去脉 。 你 开始 觉得 ： 啊 ， 知识 的 获取 如此 容易 。 于是 你 在 知识 获取 的 路上 不仅 有 了 拐杖 ， 你 还有 了 引路人 ， 连 怎么 走 的 不用 思考 。 是 啊 ， 我 文言文 很烂 读 《 论语 》 太 吃力 ， 黑格尔 的 文字 太 抽象 川端康成 的 描述 太 晦涩 ， 卡夫卡 的 逻辑 就 像 个 没头苍蝇 一样 撞 来 撞 去 ， 你们 都 长 得 太丑 ， 我 只 看 脸 ， 不 看 你 。 于是 你 忘记 了 这个 社会 最 基本 的 捕食 本领 ： 思考 。 思考 是 整个 社会 发展 的 动力 ， 它 赋予 了 世人 追寻 自由 和 美的 价值观 。 我们 才 知道 ， 除了 碌碌无为 地 活着 ， 我们 还 可以 拥有 丰富 的 人生 ， 可以 追求 实现 一个 不 一样 的 世界 。 和 那些 思辨 带来 的 美妙 相对 比 ， 快 文化 有 这么 几个 特点 ：①  碎片 时间 捕捉 。 快节奏 的 现代 生活 方式 是 很大 诱因 ， 我们 忙于 工作 、 忙于 社交 、 忙于 展示 自我 、 忙于 改变 整个 世界 ， 每 一天 都 被 这些 高 优先 的 事情 分割 开来 ， 剩下 的 时间 碎片 实在 鸡肋 ， 消费 快 文化 既 能 减少 焦虑 感 ， 又 能 让 自己 的 大脑 低功耗 运作 ， 久而久之 人们 便 对 快 文化 上 了 瘾 。②  短小 作品 扩散 。 前 几天 老五 跟 我 说 ， 他 把 微 博 卸载 了 。 我 问 他 为什么 啊 ？ 他 说 微 博 现在 流行 各种 短 视频 ， 也 就 三五分钟 图 个 乐 呵 ， 每 一篇 时间 都 不 长 ， 但是 看 多 了 容易 上瘾 。 要是 多点 开 几个 ， 半个 小时 、 一个 小时 就 没 了 ， 太 浪费时间 。 我 听 完 笑笑 ， 还 不是 你 自控力 不够 么 非 要点 开 。 但是 细心 想想 ， 我们 消费 的 这些 视频 除了 舒缓 心情 ， 还 能 给 我 带来 别的 什么 吗 ？③  减少 思辨 活动 。 也许 是 乔帮主 苹果 大法 的 延伸 ，“ 顾客 往往 不 知道 自己 想要 什么 ” 这样 的 思维 同样 指引 着 快 文化 的 发展 ， 他们 发现 ， 顾客 真的 开始 停止 思考 了 。 周杰伦 穿着 美特斯 邦 威 我 觉得 很酷 很 有 范 。 好 吧 我 不管 他 穿着 舒 不 舒服 质量 怎么样 这 套 我 就 买 了 服务员 来 结账 ！ 我 却 根本 不 知道 自己 既 唱 不 出 《 七里香 》 又 是 个 丑 逼 。④  强调 直观 感受 。 内心 个人主义 在 快 文化 里 找到 了 土壤 ， 五花八门 的 快 文化 让 人 找到 了 轻轻 的 快感 ， 惰性 于是 在 此 深度 发酵 ， 进入 了 一种 “ 我 好像 做 了 很多 ” 这样 的 幻觉 里 。 其实 仔细 回味 一下 ， 我 看 的 内容 十条 有 八条 都 是 垃圾 信息 ， 除了 感动 自己 之外 ， 对 我 自身 人生 发展 有 什么 帮助 么 ？ 无论 哪 一种 社会 里 ， 量 多 都 不 代表 优质 。 匠心 -- 在 快 文化 的 大潮 下 ， 如果 非 要 选择 ， 我 愿意 去 十年磨一剑 ， 用 匠人 之 心 面对 这个 世界 。 几年 前 我 在 台湾 的 一个 阿姨 家里 做客 ， 阿姨 带 我 看 了 一张 古代 木床 ， 带 棚顶 的 那种 。 她 说 ， 这 是 祖先 从 明 郑 时期 传下来 的 ， 床 梁 上 那些 花纹 刻 着 一个 南北朝 的 爱情故事 。 她 的 婆婆 现在 还 睡 在 这 张 床上 ， 台湾 的 潮湿 让 床 有些 变形 ， 但 依然 坚固 。“ 三百多年 了 哦 ， 我 盼 它 还 能 用 上 三百年 。” 阿姨 说起 这 句 话 时 ， 眼里 深沉 的 骄傲 让 我 惭愧 。 前人 传给 我们 的 是 那个 时代 的 精神 艺术 结晶 ， 比如 珐琅 彩 、 富春山 居 图 、《 红楼梦 》， 而 我们 能 给 后人 留下 什么 呢 ？ 宜家 么 ？《 浮士德 》 成书 耗时 64 年 有人 会 反驳 ： 存在 即 合理 ， 快 文化 就 没有 一点点 优点 吗 ？ 你 能 保证 你 生活 中 没有 一点点 快 文化 元素 ？ 我 可以 明确 地 告诉 你 ， 我 有 ， 而且 不 比 你 少 。 对于 某 一个 未知 的 领域 ， 快 文化 可以 帮 我 牺牲 知识 的 深度 ， 来 增加 知识 的 广度 。 在 扩大 知识 的 广度 后 找到 兴趣 相投 之 处 ， 再 以 深度 来 对待 。 我 身边 有 太 多 的 快 文化 的 信徒 ， 他们 的 广博 仿佛 像 大海 一样 无边无际 ， 没有 什么 话题 是 他们 接 不 上 的 ， 但 随着 话题 的 深入 我 才 发现 他们 所谓 的 了解 都 是 浅尝辄止 。 那种 感觉 仿佛 就是 到 了 世界 的 尽头 ， 我 站 在 海平面 上 漂浮 无 根 ， 满眼 都 是 粉红 的 天海 相接 和 幽 蓝 的 汩汩 暗流 。 低下头来 望 着 水面 ， 我 却 只能 看见 自己 。 我 既 没有 想法 、 也 没有 坚持 ， 我 孤独 ， 并且 空无一物 。 快 文化 自有 其 扎根 生长 的 土壤 ， 决定 大多数 人生 选择 的 是 角度 ， 而 不是 对错 本身 。 我 无意 把 快 文化 妖魔化 ， 中午 吃 过 满汉全席 晚上 坐在 路边 撸 串 的 大有人在 ， 我 只是 坚信 ， 不管 社会 变得 怎样 浮躁 ， 总 有人 愿意 为了 这个 值得 奋斗 的 世界 去 注满 汗水 。","title":"「 快 文化 」 崇拜 的 尽头 是 孤独 海 ","oriTitle":"「快文化」崇拜的尽头是孤独海"},{"uri":"https://redblue.ga/spirits/thinking/me","tags":[],"content":" 你好 ， 中国 >  在 世界 的 东方 ， 有 一个 古老 的 国度 ， 美丽 而 宽广 ，  在 世界 的 东方 ， 有 一个 伟大 的 民族 ， 勤劳 而 坚强 ；  奔腾 不息 的 黄河 是 她 的 血脉 ，  巍峨 屹立 的 泰山 是 她 的 脊梁 ，  这 就是 我们 的 祖国 —— 中国 ！ 1949  年 ， 一位 伟人 挥动 着 巨臂 ， 一声 宣告 ， 驱散 了 神州 五千年 的 阴霾 ； 1978  年 ， 一位 巨人 以 超人 的 胆识 ， 审时度势 ， 将 尘封 的 国门 向 世界 洞开 ！ 1997  年 ， 她 迎来 了 紫荆花 的 清香 ， 1999  年 ， 她 又 增添 了 水 莲花 的 芬芳 ！  走过 世纪 的 风雨 ， 万里长城 像 巨龙 在 云中 穿梭 ，  跨过 岁月 的 长河 ， 珠穆朗玛峰 像 雄鹰 傲立 世界 最高 坡 。  我们 的 共和国 从 没有 像 今天 这样 威武 强大 。 很 幸运 、 很 骄傲 我 是 一个 中国 人 ...1997  年  6  月  30  日 午夜 至  7  月  1  日 凌晨 ， 香港 会议展览 中心 新翼 灯火辉煌 ， 举世瞩目 的 中英两国 政府 香港 政权 交接仪式 在 这里 的 五 楼 大会堂 隆重举行 。1997  年  7  月  1  日 零点 整 ， 中华人民共和国 国旗 和 香港特别行政区 区旗 在 香港 升起 ， 经历 了 百年 沧桑 的 香港 回到 祖国 的 怀抱 ， 中国政府 开始 对 香港 恢复 行使主权 。 历史 的 时钟 指 在  1997  年  7  月  1  日 零点 那一刻 ， 大会堂 全场 肃立 ， 几千 双 眼睛 向 鲜艳 的 五星红旗 和 紫荆花 区旗 行 注目礼 。 这 是 中华民族 长久 期盼 的 一个 瞬间 ， 这 是 永 载 世界 史册 的 一个 瞬间 ！ 亦 正是 这个 令人 值得纪念 的 日子 ， 我 从 一个 受精卵 经过 久久 进化 成形 幻化 在 滇南 的 一个 小镇 上 。 论 出身 我 早已 四分五裂 ， 没有 家 我 喜欢 豆沙饼 ， 因为 那 是 我 外公 生前 最 爱 的 东西 外公 ？ 没错 ， 我 对 我 外公 有着 最 特殊 的 感觉 。 他 走 的 时候 ， 我 刚刚 升 四年级 ， 每年 上坟 祭拜 ， 那 小小年纪 我 总是 畏惧 鬼魂 传说 不敢 靠近 坟堆 的 。 然而 ， 外公 的 墓 前 ， 我 却 能 放下 畏怯 。 他们 的 年代 ， 还 没 赶上 改革开放 ， 但是 我 外公 却 带 一家人 自 建 水泥 房 ，（ 方言 ） 倒 梨花 、 买 摩托 … 他 是 那样 严厉 却 坚毅 还 善良 ， 他 的 遗物 多 是 先进个人 等 表彰 物 。 在 那 祠堂 里 最 显眼 的 就是 那 块 捐建 我 上 的 那个 小学 教育局 给 颁发 的 牌匾 。 可以 说 那个 时代 他 是 镇上 的 名人 、 富人 。 不过 一切 源于 一场 意外 ， 我 二舅 在 山间 出 了 车祸 ， 他 的 陨落 ， 像是 决定 了 一个 家族 的 趋势 。 直到现在 ， 我 却是 表 系 、 堂 系里 唯一 一个 上 大学 的 孩子 。 而 我家 在 表 系里 已经 算 得 上 是 最 经济 好 的 家庭 二舅 ！ 说实话 ， 我 没 真的 见 过 他 ， 因为 他 离开 的 时候 ， 我 还 没有 出生 ， 甚至 间隔 好几年 。 有 一天 我 就 看见 他 的 照片 ， 我 却 非常 敏感 的 辨出 他 与 我 非常 像 （ 外貌 ）， 我 哥哥 也 是 这么 说 的 我 的 爷爷 ， 京戏 爱好者 ， 对 他 最佳 的 记忆 就是 他 在 院里 和 一群 友人 拉 二胡 唱戏 。 可 奇 了 怪 了 ， 四个 男丁 ， 他 却 没有 培养 出 一个 戏子 或者 是 一个 会 二胡 的 孩子 ， 不过 他 也 从来 没 培养 过 ， 大概 是 他 觉得 年轻人 不会 喜欢 吧 。 他 最后 有 留下 自己 亲自 做 的 蛇皮 二胡 ， 不过 至今 已经 封存 在 不起眼 的 箱子 里 很久很久 了 。 我 的 外婆 ， 一个 善良 落 世 的 孤独 者 。 上次 寒假 带 她 到 城里 买 衣服 ， 结果 她 死活 不肯 上 手扶 电梯 ， 最终 在 踏出 脚 的 那一刻 慌乱 差点 倒掉 ， 我 扶 她 的 时候 都 能 感到 从 她 那 老 去 的 身体 里 迸发出 的 生命力 。 说真的 ， 像 我 这种 刚刚 入世 青年 都 会 畏惧 时代 的 变迁 和 都市 的 节奏 ， 更何况 她 一个 活 在 上 世纪 的 现代人 ··· 表 系里 最 有 价值 的 故事 ， 还有 一个 人 ， 就是 我 妈 。 此处 省略  N  个 字 说 起来 就是 ， 外公 外婆 的 善良 造就 了 我 妈 ， 而 我 妈 造就 了 我 ","title":"I'm 「 赤 琦 」","oriTitle":"I'm 「赤琦」"},{"uri":"https://redblue.ga/spirits/thinking/new-life","tags":[],"content":" 开始 --2016  年 一场 高考 后 ， 经过 两个 多月 的 志愿 挣扎 ， 我 还是 来到 了 这里  —  一所 假装 有 百年 历史 的 工科大学 的 校企 二级 学院 （ 说 半天 就是 一所 省级 二流 学院 的 子 学院 ）。 第一次 来到 这里 ， 还是 验证 了 那 句 现实 总 比 想象 要 残酷 的话 。 古旧 的 教学楼 ， 非常 自然 气 的 操场 ， 没有 桌子 的 宿舍 …… 不过 我 还是 非常 淡然 ， 毕竟 我 不 属于 城市 。 这里 是 场 恶战 ， 亦 是 馈赠 。 现在 是  2018  年 ， 我 已经 大二 了 下学期 了 ， 心 却 还是 没有 安 处 。 热情 -- 其实 我 是 一个 环境 适应性 比较  OK  的 人 ， 但是 这个 具有 鲜明 应试教育 的 学院 （ 一流大学 和 普通 大学 最大 的 区别 ） 还是 把 我 打 得 难以 遁形 。 班委 没 能 竞 上 （ 差点  0  票 ， 本来 觉得 自己 刚 来 的 时候 人际 还是  OK  的 ， 不过 幸好 没 选 上 ）， 后来 我 面试 了 学校 的 文娱 部 （ 唉 ， 我 本性 中 也 有 这 一面 的 ）， 其实 面试 都 过去 了 ， 最后 我 没 选择 留下 ， 却 非常 阴差阳错 的 被 推荐 去 党建 中心 （ 我 对 党 没有 一点 兴趣 的 好 吗 ， 当然 那 是 之前 ， 现在 嘛 ， 我 是 粉 ）， 这 是 个 美丽 的 错误 ， 虽然 干 了 一些 非常 杂 的 活 ， 不过 好 在 这个 部门 给 了 我 在 这个 大学 最 美好 的 友谊 时光 。 我 认为 做 什么 不 重要 ， 重要 的 是 跟 什么 人 一起 做 。 在 这 其中 我 还 面试 了 一个 对 我 来说 非常 重要 的 组织 —— 一个 学生 和 行政部门 组建 的 管理 学校 多媒体 的 野 组织 （ 其实 就 是非 学生会 组织 ， 名 网 科组 ）， 说实话 ， 这个 组织 没什么 意义 ， 实际 也 真的 没什么 意义 ， 不过 它 有着 最 美妙 的 作用 ， 这 也 是 我 为什么 大 一 选择 留下 当 组织者 的 最 重要 的 原因 （ 后 话 ）。 这个 组织 在 我 第一次 在校 被 浇冷水 的 时候 给 了 我 一线生机 ， 却 又 给 我 一头 冷水 ， 不过 总的来说 我 是 爱 它 的 。 自己 从 五年级 家里 有 第一台 电脑 开始 ， 就 对 神奇 的 计算机 世界 有 非常 的 探索 欲 。 当然 天天 应试 ， 还有 较为 封建 的 父母 ， 我 并 没有 什么 机会 深入 （ 扯远 了 ）。 当时 面试 我 的 是 一位 经验丰富 的  ACMer  垃圾 佬 （ 超级 厉害   的 ， 像 我 这种 数学 渣 渣 不 知道 有 多 羡慕 这种 人 ， 不过 也 只是 羡慕 就 没有 然后 了 ， 我 就是 这种 被动 的 人 ~）， 我 一直 以为 他 是 学长 ！ 其实 是 同 届 …… 面试 完 我 就 觉得 这 才 是 理想 中 想要 加入 的 组织 ， 我 热情高涨 啊 ~ 其实 ， 也 就 那样 吧 ， 不过 不得不 承认 尽管 之后 的 工作 没有 让我学 到 很多 ， 但是 它 给 了 我 在 这个 学校 的 勇气 。 自省 -- 第一个 学期 ， 繁忙 的 学习 就让 我 感到 非常 吃力 特别 是 各种 数学 Oh~ 忘 了 说 ， 我 的 专业 是 物 联网 工程 ， 说实话 ， 当 我 知道 它 是非 计算机专业 的 时候 T^T， 电子信息 工程系  emmmm……， 这 直接 导致 我 觉得 突然 倒 回 高中 ， 甚至 比 高中 还 惨 ~ 因此 ， 我 一路 挂 科 ， 你 知道 的 都 是 专业课 ， 当然 我 是 真的 没 努力 ， 虽然 努力 听课 了 。 在 认识 大佬 （ 面试 我 的 同学 ） 后 ， 我 知道 了 一个  ACM  的 比赛 ， 不过 那时 我 没有 电脑 ， 而且 也 很 怕 数学 ~ 也 就是 算法 ， 那次 很 水 的 初赛 我 一 题 也 没 做 出来 ， 我 还 记得 当时 的 每 一个 场景 ， 尽管 只是 非正式 的 初赛 。 从那以后 我 就 再 没 捡起  C  语言 （ 活该 是 个 菜 鸡 ， 错过 了 多少 ， 又 不 愿意 做 起来 ， 怂 ）。 后来 ， 经过 教育 机构 的 各种 洗脑 ， 我 进 了 一个 前端 的 学习班 ， 认识 了 一个 某 知名 互联网 的 技术 总监 ， 说 起来 我 挺 喜欢 他 的 ， 不然 也 不会 入 坑 ~（ 真正 说 起来 ， 我 是 那种 主动 学习 ， 被动 接受 的 ， 就是 非得 有 个人 ， 或者 是 我 突然 非常 非常 想 实现 的 ， 不然 就算 想 了 也 不会 做 ， 这 也 是 现在 为什么 这么 菜 的 原因 ， 尽管 我 知道 ， 但是 情商 低 ， 稳 不住 ）， 现在 也 没什么 会 做 的 ， 也 就 无所谓 的 坚持 去 上课 了 。 再 后来 ， 我 混进 了 本部 的  ACM  在线 评测 开发 团 ， 进去 后 发现 满地 的 大佬 ， 听 学长 投 简历 ， 收  Offer  到 手软 ， 各种 大 公司 ， 哇 ， 真的 让 人 很 受 感染 。 他们 中 ， 有的是 初中 就 开始  ACM， 有的是 高中 ， 也 有 大三 最后 一年 速成 的 （ 可能 这 就是 大佬 吧 ）， 他们 也 曾 迷茫 过 ， 但 通过 坚持 ， 获得 了 非凡 的 成就 。 认识 越 多 人 就 越 慌 ， 因为 发现自己 什么 都 不会 。 但 自己 却 在 一 日复一日 挥霍 时间 ， 因此 想到 了 坚持 写 博客 的 想法 ， 想 多一份 不 需要 知道 为什么 的 坚持 。 来自 电影 >  如果 提前 了解 了 你 所 要 面对 的 人生 ， 你 是否 还 会 有 勇气 前来 ？——2018.1.172017 年 ， 习近平 在 十九 大 报告 指出 ， 中国 已经 进入 社会主义 建设 新 时代 ， 这 是 中国 发展 新 的 历史 定位 。 中国崛起 ， 让 《 时代 》 周刊 在 总结 2017 年 时 ， 极 不 情愿 承认 一个 事实 ： 中国 赢 了 ！ 也 让 英国 媒体 感叹 中国崛起 是 21 世纪 最 伟大 的 传奇 之一 。 这 年 也 是 人工智能 爆发 的 一年 ， 国务院 印发 《 新一代 人工智能 发展 规划 》， 编程 教育 开始 在 中小学 课程 中 逐步 设置 ， 同时 人工智能 上升 为 国家 战略 ， 被 看作 是 新 时代 的 引擎 …… 隐约 中 ， 国家 给 我 注入 了 一种 前所未有 的 能量 。 也 是 这 年 ， 经历 了 学习 、 生活 、 家庭 各 方面 带来 的 从未有过 的 压力 ， 多次 感 几近 被 扯断 的 临界 边缘 ， 却 又 似乎 在 弹性 限度 之内 ， 大概 是因为 忙碌 耗尽 了 自我 拉扯 断裂 的 力量 。 我 发现 ，  有时候 自私 是 唯一 能 保护 自己 的 ， 而 无私 是 能够 包庇 自己 的  。 我 不 愿 提起 这些 ， 只是 每次 被 提起 都 会 红了眼 。 近来 ， 看 了 两部 电影 ， 可能 是因为 考试 周 没 课 ， 工作 也 慢慢 停止 了 ， 很少 有 看 电影 这种 想法 的 我 却 很 冲动 的 要 看 《 芳华 》 和 《 无 问 西东 》。 并非 是 出于 明星阵容 、 票房 第一 或是 网络 热 议 的 原因 ， 像是 出自 一种 情怀 ， 一种 共鸣 ， 一种 感觉 。 两部 片子 对 我 来说 有 俩 相同 的 冲动 点 —— 片中 提及 的 蒙自 历史 和 青春 。 不过 至今 我 也 从未 去过 哥 胪 士 洋行 、 蒙自 海关 税务司 署 、 法国 领事 府 、 周家 宅院 、 王家 旧宅 、 碧色 寨 火车站 ， 是 的 ， 离家 那么 近 的 地方 ， 二十一年 来 我 却 从未 踏足 过 ， 只是 脑海 里 总 对 西南联大 有 一种 特别 的 印象 。 或许 是 大学 之前 的 自己 是 真的 “ 未成年 ”， 亦 或许 是 大学 所 经历 的 以及 离家 后 催生 的 那 份 家乡 情 ， 竟 因为 这 两部 电影 觉得 那些 在 蒙自 生活 的 时光 白 过 了 。《 芳华 》 里 那 群 正值 芳华 的 青春 少年 ， 经历 着 成长 中 的 爱情 萌发 与 充斥 着 变数 的 人生 命运 故事 ， 新旧 时代 一代人 的 变化 ， 每个 人 都 一样 ， 却 又 那么 的 不 一样 。《 无 问 西东 》 是 清华大学 百年 校庆 的 献 片 ， 四个 不同 时代 却 同样 出自 清华大学 的 年轻人 ， 对 青春 满怀 期待 ， 也 因为 时代 变革 在 矛盾 与 挣扎 中 一路 前行 ， 在 迷茫 的 年少 时期 ， 被 点拨 ， 被 引导 去 叩问 内心 ， 做出 适合 自己 的 、 真正 想要 去 做 的 选择 ， 不顾 他人 言语 ， 不顾 世俗 评价 ， 立德 立言 ， 无 问 西东 ， 寻 到 真实自我 。 其实 《 无 问 西东 》 这部 影片 被 拖 这么 几年 ， 一点 也 不 晚 儿 ， 反而 刚刚 好 ， 刚刚 好 我国 复兴 ， 给 大学生 乃至 青年人 一次 有力 的 打气 。 而 我 这 久 ， 忙碌 后 的 空闲 让 我 的 心 无处 安放 ， 曾 彻夜未眠 去 想 去 做 自己 的 工作 ， 急于 在 人生 矛盾 的 阶段 想 稳定下来 ， 想 冲出 迷雾 迎来 光明大道 ， 也 常常 思考 我 生命 的 那 份 真实 到底 是 什么 …… 很多 思考 ， 现在 有 了 答案 ： 把 自己 交给 繁忙 ， 得到 的 是 踏实 ， 却 不是 真实 你 看到 什么 ， 听到 什么 ， 做 什么 ， 和 谁 在 一起 ， 如果 有 一种 从 心灵深处 满溢 出来 的 ， 不懊悔 也 不 羞耻 的 ， 平和 与 喜悦 ， 那 就是 真实 这个 世界 缺 的 不是 完美 的 人 ， 而是 从 心底 给出 的 真心 ， 正义 ， 无畏 与 同情 爱 你 所 爱 ， 行 你 所 行 ， 听从 我心 ， 无 问 西东 电影 结尾 的 彩蛋 加上 对 自己 学习 、 生活 和 工作 的 审视 以及 一直 以来 对 其他 学校 不间断 的 差异化 分析 ， 豁然 明白 为什么 要 好好 读书 ， 到底 大学 有 什么 不同 ， 感 概 良多 。 至此 ， 也许 我 还 不 知道 我 要 什么 ， 至少 我 知道 我 不要 什么 。 不再 流浪 ， 心 有所 安 。 博客 意义 我 一直 是 那种 记忆力 很 好 的 人 （ 不过 没用到 学习 上 ~）， 但是 经历 了 学习 、 生活 、 家庭 各 方面 带来 的 从未有过 的 压力 ， 多次 感 几近 被 扯断 的 临界 边缘 ， 却 又 似乎 在 弹性 限度 之内 。 大概 让 我 的 存储 开始 缓慢 ， 因此 想 记录下来 多次 反省 自己 ， 检测 自己 是否 有 在 学习 ， 总结 发展 给 自己 的 积累 留下 一点 印记 ， 我 特别 喜欢 看 圆桌 派 ， 他们 都 是 有 积累 的 人 分享 我 的 见解 如果 可能 ， 给 别人 一些 帮助 记录 每次 的 心理 进化 希望 毕业 这些 积累 能 帮助 我 关于 此 算是 博客 的 开始 吧 ， 想要 写 已经 很 久 了 ， 终于 写 了 ， 这个 拖延 症 怕 是 没治了 ， 希望 这 是 治疗 的 第一步 ， 很 晚 了 ， 想 写下去 ， 不过 明天 还要 上课 ， 慢慢 写 吧 你好 -- 你好 ， 我 是 赤 琦 ， 请 多 指教 ","title":"「 涅槃 」 立德 立言 ， 无 问 西东 ","oriTitle":"「涅槃」立德立言，无问西东"},{"uri":"https://redblue.ga/spirits/thinking/old-perfectworld","tags":[],"content":"2004  年   完美 世界 封 测 了 3D  无缝 接 大 地图 、 全 种族 立体 自由 飞行 、 海陆空 全方位 战斗 、 人物形象 自定义 、 古色古香 的 中国 风 … … 一个个 首创 、 一个个 全国 第一 … … 震惊 了 全国   震撼 了 每 一个 人 让 我们 看到 了 国产 网游 崛起 的 希望 魔兽 算得了 什么   我 义无反顾 的 投入 了 完美 的 怀抱 祖 龙   带给 了 我们 太 多 的 惊喜   太 多 的 感动 祖 龙   国产  3D  单击 游戏 的 第一 人   自由 与 荣耀   大 秦 悍将   抗日 — 血战 上海滩   抗日 — 血战 缅甸 … …2005  年   完美 公测 了  30  万 人 同时在线 ， 到达 了 当时 国产  3D  网游 的 巅峰 我们 骄傲   我们 自豪   我们 发自内心 的 喜悦 一大帮 兄弟姐妹   一起 打 怪   一起 下 副本   一起 打 城 站 … … 我们 一起 奋斗   一起 努力   同甘共苦   生死与共 … …2006  年   完美 出 国际版 了 期望 变成 了 失望   国际版 竟然 全 是 国人  G  挂 满天飞   有钱人 的 天下 完美 向钱看 齐 了   不再 专注 于 开发 游戏   只在乎 如何 圈钱 完 美国  F  从此 一蹶不振 （ 可能 …2  年 多 没 怎么 更新 吧 ） 武林 外传 、 诛 仙 、 赤壁 、 热舞 派对 、 口袋 西游 、 神鬼 传奇 … … 游戏 一个 接 一个 的 出 , 一个个 多胞胎 , 一代 不如 一代 , 越做越 回去 了 听说 最近 准备 生 个 梦幻 诛 仙 , 直接 变  2D  的 了 从  3D  退化 到 神鬼 传奇 的  2.5D, 再 退化 梦幻 诛 仙 的  2D! 真是 让 人 无 语 了 … … 曾经 的 祖 龙 , 到 哪里 去 了 ?!! 曾经 扬言 要 做 中国  3D  网游 第一 团队 的 祖 龙 还 在 吗 ? 期待 新 的 完美 世界 , 期待 曾经 的 完美 世界 ! 不知 日落 又 升 , 多少 个 夏秋 . 不知 我 以 这样 , 奔跑 了 多久 . 我 从 出生 就 注定 一生 的 寻求 , 远方 那 完美 世界 那 爱 和 自由 !fly with me in zhe perfect word,go with me,just like bird. 没什么 , 能 阻拦 自由 的 天地 …PS： 不经意 间 看到 国  F  和 国际 新版 主 那么 的 努力 着 , 半夜 还 起来 回答 我们 玩家 的 问题 . 其实 , 内心 是 十分 感动 的 . 至少 , 你们 是 真的 回来 了 ! 还 没有 放弃 我们 . 希望 不是 昙花一现 , 我们 , 需要 一起 努力 进步 !! 完美 时空 就 完美 世界 做 的 还 可以 ， 像 诛 仙 ， 神鬼 其实 都 做 的 不怎么样 ， 只是 投放 的 广告 多点 ， 现在 完美 时空 还 在 开发 一系列 的 垃圾 游戏 ， 中国 的 玩家 已经 被 各种 垃圾 游戏 折腾 的 麻木不仁 了  ， 再 做 各种 游戏 想要 抢占市场 份额 那 就 很 难 了 ， 比如 一个 玩 了  3-4  年 魔兽 世界 的 玩家 再 让 他 去 玩 其他 的 游戏 ， 就 会 觉得 其他 游戏 很 幼稚 而 不 适应 ， 玩惯 了 完美 世界 的 人 再 去 玩 其他 的 游戏 ， 觉得 其他 游戏 画面 是 那样 粗糙 ， 武器 是 那么 难看 ， 人物 角色 是 那么 丑陋 … 我们 玩 的 当前 版本 完美 世界 是 一个 没有 做 完   的 游戏 ： 完美 世界 的 游戏 背景 故事 中 有 关于   五帝 之 都 的 故事 即 “ 五帝 名 都 ”， 分别 为 ： 黑 帝 之 都 ， 青 帝 之 都 ， 白 帝 之 都 ， 赤帝 之 都 ， 黄帝 之 都 。 当前 游戏 版本 中 只 出现 了   黄帝 之 都 — 即 是 所有 玩家 都 去过 的 那 座 气势 宏伟 的 祖 龙城 — 游戏 中 人物 最高 等级 是  150  级  ， 可是 当前 版本 只 开放 到 了  100  级 左右 ， 游戏 中 还有 若干 - 如 家园 - 末日 封神 没有 做 完 ， 若干 职业 和 种族 没有 出现 ， 玩 过 ** 的 都 知道 夜郎 村 那边 有  105  级 的 怪 ， 有 部分 地图 玩家 从来 没 去过 …. 当 你们 自己 修改 人物形象 代码 的 时候 就 会 发现 有 几个 文件 对应 不到 当前 游戏 里面 的 职业 —- 这 都 和 祖 龙 工作室 的 解散 有关 原本   祖 龙 工作室     想要 把 完美 世界 当做 一个系列 来 开发 ， 整个 完美 世界 其实 是 一个 规模 非常 庞大 的 虚拟世界 ， 如果 祖 龙 工作室 能够 继续 开发 完美 世界 ， 那  5  坐 巨大 的 主城 都 会 呈现 在 玩家 面前 .. 规模 估计 不会 小于 魔兽 世界 很 遗憾 由于 种种原因 祖 龙 工作室 离开 了 完美 时空 ， 而 给 我们 留下 了 一个 半成品 …. 完美 时空 没有 了 维持 完美 世界 风格 的 创作 团队 ， 这个 游戏 历经 数年 几乎 没有 什么 变化 。。 其实 完美 时空 可以 学习 暴雪 开发 魔兽 世界  ， 将 完美 世界 当作 一款 精品 游戏   进行 深度 开发 .. 凭借 其   杰出 的 游戏 画面 ， 丰富 细微 的 人物 自定义 形象 ， 东方 玄 幻 色彩 的 游戏 内容 ， 纯 中国 仙侠 文化 特点 ， 加上 有力 的 宣传 在 中国 占领市场 是 很 容易 的 事情 ， 绝大部分 玩 过 这个 游戏 的 玩家 都 认为 这 是 一款 值得 玩 的 游戏 。 现在 完美 世界 国际版   推出 了  2  个 资料片   天 怒 神 罚 和 精灵 战歌 ， 对外 宣传 是 资料片 ， 其实 只是 打着 一个 幌子 而已 ， 像 魔兽 世界 的 资料片 - 燃烧 的 远征 和 - 巫 妖 王 之 怒 都 是 大规模 增加 游戏 内容 如 副本 – 怪物 ， 增加 职业 种族 ， 新 的 技能 ， 玩法 ， 而 完美 世界 国际版 的  2  个 资料片 对 游戏 基本 没有 什么 大 的 变动 ， 之所以 叫 资料片 也 是 完美 时空 不得 以 的 商业 策略 ， 因为 目前 世界 上 的 游戏 都 流行 开发 资料片 ， 很多 游戏 就是 一个 小 补丁 而已 ， 为了 吸引 眼球 美其名曰 为 “ 资料片 “。 完美 时空 的  2  个 资料片 其实 就是  2  个 游戏 小 补丁 ， 真正 要 做到 像 暴雪 的 魔兽 世界 那样 水平 的 资料片 ， 那 是 不 可能 的 ， 除非 祖 龙 工作室 的 原班人马 上阵 ， 祖 龙 工作室 不但 做 游戏 水平 高超 ， 而且 中国 文化 特色 把握 的 也 很 准确 ， 这点 可以 从 祖 龙 成 建筑 结构 和 布局 ， 完美 世界 各个 地方 的 名字 ， 修 真 仙 魔 道 ， 武器 名字 等等 看出 …. 完美 时空 当前 将 大量 资金 和 资源 投 在 诛 仙 和 神鬼 还有 其他 一系列 垃圾 上 实在 是 舍本逐末 的 做法 ， 固然 游戏 都 有 生命周期 ， 但是 才 运营 了  3  年 左右 的 游戏 就让 其 自生自灭 外挂 泛滥 ， 实在 不是 明智之举 … 完美 世界 是   完美 时空 的 发家 之 本 ， 本来 这个 游戏 就 有 笑傲 天下 网游 的 资质 ， 如果 善待 之 ， 完美 时空 能 成为 中国 的 暴雪 …….. 现在 完美 世界 逢年过节 多 开 箱子 活动 — 里面 有着 大量 的 顶级 装备 ， 这个 纯粹 就是 变相 的 直接 售卖 给 玩家 装备 ， 直接 打破 游戏 里 的 职业 平衡 ， 游戏 做到 这个 地步 ， 离 生命周期 尽头 已经 很 近 了 ， 估计 完美 时空 是 想 借鉴 一下 征途 的 揽 钱 模式 ， 可是 为何 不再 继续 学习 他们 的 模式   再造 一个   怀旧 版   的 《 完美 世界 》  花 个   一年半载 的 功夫 砸 下 几百几千 万 零头 小钱 ， 去除 当前 游戏 里 种种 诟病 ， 许 会 有 离开 了 的 玩家 重返 完美 世界 ………. 如果 完美 时空 对 这个 游戏 还是 无所作为 ， 我们 不得不 质疑 ， 即使 是 他们 全力 推广 的 诛 仙   是不是   开发 了 新 游戏 后   也 会 和 完美 世界 下场 一样 ， 他们 的 游戏 我们 值得 投入 大量 时间 金钱 真情 么 ？ 完美 国际 经典 特色 1  主题曲 经典 —- 放眼世界 没有 哪个 游戏 的 主题曲 如此 脍炙人口 2， 人物 角色 帅气 漂亮 ， 老少 皆 喜 3， 纯 中国 特色 玄 幻 ， 可 自由 飞翔 ，4， 领地 争夺 ， 联合 分化 ， 纵横捭阖 ， 征服 一方 豪气万丈 5， 聊天 交友 帮会 表情 形象 方便 6， 背景音乐 极佳 ， 武器 技能 特效 华丽 ， 人物 动作 自然 ， 场景 逼真 7…….. 还有 很多 略 游戏 恶 状 ：1， 外挂 泛滥 ，2， 职业 不 平衡 3， 升级 经验 多 ， 任务 少 ， 消耗 广大 玩家 精力 时间 金钱 生命 导致 全民 皆 挂 4，GM  无所作为 ， 完美 世界 项目部 无所作为 5， 箱子 变相 出售 装备 6…… 还有 很多 略 相 比较   还是 值得 玩 的 游戏 … 作为 一个 玩 了  2  年 的 玩家  ， 花 了  1  天 的 时间 第一次 在 论坛 发 这样 的 帖子 ， 是 在 是 不忍心 看着 这 款 游戏 继续 就 这样 消亡 ……….. 今天 不得不 站 出来 说说话 ….. 附上 祖 龙城 和 祖 龙 工作室 资料 ： 乱世 中 建成 的 祖 龙城 ， 别 有 一种 沧桑 与 大气 。 整座 城 分 城东 、 城南 、 城西 、 城北 四块 ， 各 有 守卫 守护 城门 ， 站 在 城外 远处 观望 ， 其 气势 可谓 非常 雄伟 和 庄严 。 走入 正门 ， 硕大 的 雕像 便 映入 了 眼帘 ， 远古 巨 神 的 庄重 与 威严 赫然 体现 ， 有 的 手持 上古 神剑 挥 劈 长空 ， 有 的 怀抱 神 塔 凝视 苍茫 天空 ， 还有 的 手 托 明珠 供奉 着 宁静 的 长夜 ， 怀抱 弦琴 的 那 尊 巨像 则 低头 聆听 着 手指 间 弹 揍 的 优雅 曲调 。 四尊 巨像 巍然 挺立 于 城中 广场 四角 ， 默默 的 守护 着 正中 的 蓝色 明珠 。 此 明珠 暗淡 的 隐 润 着 和谐 的 蓝光 ， 光晕 似 可 通彻 大地 ， 照亮 星河 。 放眼 四下 ， 在 祖 龙城 四尊 守护神 像 的 脚下 ， 小商贩 们 乐此不彼 的 经营 着 他们 的 小 摊位 ， 各种 琳琅满目 的 货物 成 列 在 这 繁华 的 都市 街道 上 。 而 处在 这块 完美 的 世界 土地 上 具有 重要 地理位置 的 祖 龙城 ， 也 成为 了 众多 冒险者 常年 逗留 的 集结地 。 因此 在 这里 可以 看到 各种各样 的 冒险 用具 和 补给 用品 以及 一系列 的 补给 服务 。 远离 城内 的 喧嚣 ， 独自 踏入 僻静 的 小道 ， 经过 几个 高迈 的 台阶 ， 便 可以 来到 城墙 之上 ， 此刻 站 在 城池 一角 ， 趁着 夕阳 众 览 全城 ， 除了 四个 巨 神像 安然 的 守护 着 神 珠 之外 ， 位于 城池 四周 的 平顶 石材 建筑 也 似乎 从 无形 上 给 整个 城市 奠定 了 坚固 的 架构 。 豁 大 磅礴 的 气势 稳重 低沉 的 笼罩 在 这个 被 喻为 完美 明珠 的 城池 上空 。 无论 是否 来到 过 这里 ， 或者 过去 ， 或者 将来 ， 相信 在 每个 冒险者 的 心中 ， 它 将 永远 是 一颗 不 灭 的 明珠 。 祖 龙 工作室 ： 祖 龙 工作室       英文名字 “ACSO ” 意思 是 一种 史前 的 大 蜥蜴 ， 算是 恐龙 的 远祖 为了 让 这个 名字 更 中国化 ， 故此 把 他 翻译 为 “ 祖 龙 ”。 其实 在 中国 也 早 有 祖 龙 这种 提法 ， 它 原 用来 指代 “ 秦始皇 ”。 甚至 写 过 “ 劝君 少 骂 秦始皇 ， 焚 坑 事业 要 商量 。 祖 龙 魂 死 秦 犹 在 ， 孔 学名 高 实 秕糠 ” 的 句子 。 用 “ 祖 龙 ” 来 作为 开发 团队 的 名字 ， 确实 大 有 “ 鸿鹄之志 ” 的 感觉 。 祖 龙 工作室 是 由 洪恩 集团 于  1997  年 组建 ， 专门 致力于 三维 游戏 的 研发 ， 拥有 自主 知识产权 的  3D  游戏 引擎 。1998  年 祖 龙 工作室 开发 出 世界 第一款 全 三维 即时战略 游戏 《 自由 与 荣耀 》， 远销 韩国 ， 是 国内 第一款 出口 韩国 的 即时战略 游戏 。 随后 公司 推出 的 《 大 秦 悍将 》、《 抗日 - 血战 上海滩 》 等 系列产品 也 销路 强劲 。“ 现在 完美 剩下 的 最后 的 乐土 就 只有 城 战 了 ~ 却 被 一群 用 挂 者 给 污染 了 ~ 以下 是 内容 区 的 一个 人 的 感慨 ， 句句 中肯 ， 发来 给 闭 云 看官 们 一 瞻 ： 今天 没 上 游戏 ， 静下心来 好好 想想 ， 玩 完美 有 段 日子 了 从 最早 的 国  F， 那时 的 完美 很 纯洁 … 最早 和 几个 同学 在 网吧 ， 无聊 的 在 文件夹 到处 找 游戏 ， 发现 了 这 款 完美 世界 ， 当初 被 它 的   画面 所 震撼 ， 又 是 国产 ， 于是 就 申请号 来 玩 了 ， 任务 ，FB， 飞行 … 哪里 都 打动 着 我 ， 还 记得 第一次 拿 上 个 黄   色 武器 ， 好多 人 问 为什么 我 的 武器 颜色 不 一样 … 我 说 我 这个 貌似 是  FB  出 的 。。 于是 出现 了 很多 好友 组队 去  19…. 快乐 的 时间 并不多 ， 转眼间 完美 公测 结束 ， 准备 正式 运营 ， 作为 一个 穷学生 的 我 ， 认为 点   卡 压力 有些 大 ， 便 不 舍 的 离开 了 游戏 那时 。。 我  50  级 虽然 离开 了 完美 世界 ， 但是 完美 时空 这个 名字 却 印 在 了 我 心里 ， 所以 之后 玩 了 武林 外传 ， 也 有 可能 是 喜欢 这部 电视剧 吧 … 还 不错 在 一次 浏览 网站 的 时候 ， 偶然 发现 完美 世界 国际版 ， 这个 既 熟悉 ， 又 陌生 的 名字 … 国际版 ， 可以 和 外国人 打 ？.. 当初 所有 的 思绪 和 记忆 全部 涌现 了 出来 。。 我 告诉 我 自己 ， 国际版 ， 我 一定 要 玩 … 于是 ， 告别 了 武林 外传 ， 我 踏入 了 完美 国际 .. 这个 我 充满 记忆 的 游戏 ， 而 这时 的 我 也 从 当年 的 学生 变成 一个 上班族 .. 我 选择 了  WX  这个 职业 ， 我 每天 拼命 的 练级   练习 技术 ， 我 升级 的 手段 就是 带 小号 刷  FB，49 59  甚至  69  是 我们 最 常 带 的 ，79  也 是 一个 很 好玩 的 地方 ， 各种 队伍 有 不同 的 打法 ， 相信 很多 老 玩家 记得 那种 场面 ， 世界 频道  N  多个 队伍 在 争夺 小 老板 ， 各种 新奇 的 广告语 层出不穷 ， 比 服务 ， 比 安全 ， 比 速度 ， 比 专业 … 带  FB  的 乐趣 ， 就 在于 此 … 而 酒 的 出现 。。 让 这种 记忆 成为 了 永远 的 记忆 … 等级 高 了   没 太 多 事情 干 了 ， 完美 的 又 一个 大礼 出   台 了 ， 全新 动态 副本 ， 黄昏 圣殿 … 我 相信 所有 玩家 都 愿意 承认 ， 这 是 一个 我们 所有人 都 有 能力 刷 ， 并且 有 乐趣 刷 也 有着 最高 性价比 的 地方 …1-3 2-3 3-3… 一个 一个 从没 见 过 的  BOSS  出现 。。 一种 又 一种 绞尽脑汁 的 打法 被 我们 发现 ， 游戏 .. 因此 变 的 有趣 … 而外   挂 的 出现 。。 让 这种 记忆 成为 了 永远 的 记忆 … 祖 龙 工作室 解散 了 … 看看 之后 出   台 的  FB  吧 。。 履 霜 。。 神 月 。。 魔方 。。 封神 模式 刷 法 、、、 呵呵 ， 不想 说 太 多 以上 这些 ， 我 都 可以 作为 记忆 ， 因为 就算 再 用 酒 ， 在 花钱 ， 我 还 拥有 着 一批 朋友 ， 我们 愿意 不用 酒 刷  FB， 还有 好多 人 ， 愿意 在 飞来 组 人 刷 黄昏 ， 我们 不用 挂 … 我们 也 快乐 ！ 但是 ， 我 想 说 的 是 ， 完美 ， 你 让 我 丝毫 没有 安全感 你 知道 吗 ？？ 我 说 的 安全感 ， 不是 盗   号 ， 这些 哪 款 游戏 都 有 ， 自己 注意 吧   不 多 说 。。 完美 ， 玩家 的 努力 在 你 眼里 一文不值 。。 只要 能 赚钱 ， 你 什么 都 可以 不管 今天 ， 我 还 在 满 世界 收 着 价   格 昂贵 的 无谓 ， 我 还 在 和 我 的 兄弟 ， 在 攻城  BOSS  面前 浴血 拼杀 ， 为 的 就是 那 梦想 中 的 神器 ， 明天 ，2  快 钱 就 有 可能 得到 。。 今天 ， 我 还 在 争夺 那些 赛马 高手 出售 的 披风 ， 我 还 在 争夺 那 全  F  唯一 的 坐骑 ， 我 还 在 刻苦钻研 跑 丛林 的 技巧 为 那 丛林 之 眼 ， 也许 明天 。2  快 钱 也 有 可能 得到 .. 这些 ， 我 都 不 计较 ！ 因为 他们 是 神器 ， 他们 入手 的 门槛 太 高 了 ， 他们 好 贵 ， 如果 不是  R M B  玩家 ， 真的 可能 没 机会 戴 上 了 ， 开 箱子 出 ， 没 问题 ， 全民 同乐 嘛 ！ 但是 ， 完美 。。。 你 知道 吗 .. 在 我 练 到  100  级 的 时候 ， 我 和 我 的 朋友 ， 为了 天 罪 ， 为了 森 罗 ， 我们 彻夜不眠 的 刷 天地 无用 … 我们 研究 每个 BOSS  的 打法 ， 我们 不用 挂 … 我们 几次 在 打  BOSS  的 时候 睡着 。。 我们 轮流 值班 放 音乐 。。 叫醒 睡着 的 同伴 。。 但是 你 的 暴率 真的 好 低 ， 也 可能 我们 打 的 慢 .. 快  3  个 月 下来 ， 还 没 见到 那个 材料 .. 但是 我们 没有 放弃 ， 我们 乐此不疲 ， 我 甚至 已经 想到 了 橙色 材料 爆出 的 时候 ，UT  会 欢呼 成 啥 样 … 但是 你 一个 更新 。。 宝箱 上架 、、 满 世界 的 红 字 天地 灵 心 ， 黄昏 权杖 ….100  武器 我 做 出来 了 。。 但是 我 一点 也 不 高兴 你 知道 吗 完美 ， 我 感觉 我 曾经 几个 月 的 努力 ， 你 好像 是 笼子 前 的 观众 ， 拿 香蕉 逗 了 我 几个 月 ， 我 哈喇子 都 留 出来 了 ， 我 才 发现 我 身后 有 一堆 香蕉 … 拿到 武器 后 我 最 怀念 的 却是 当初  3-3  的 时间 ， 但是 你 这个 活动 之后 ， 没 人 在 愿意 和 我 去 刷 了 。。 大家 都 在 等 下 一次 … 黄昏 伤心 了 ， 于是 我 上 论坛 ， 到处 请教 高手 ， 神 月 的 刷 法 ， 我 没有 用 太 多 的 封神 ， 而是 和 朋友 一起 ， 组队 探险 这个  FB.. 果然 不及 人家 用 挂 的 我们 刷 的 就是 慢 。 但是 我们 能 刷 到 东西 ， 而且 我们 这个 过程 很 开心 ， 有说有笑 ， 我 许诺 让 队里 每个 人 都 穿 上 神 月 装备 ， 我 说 我们 一起 努力 ， 我 说 我们 才 是 最 快乐 的 。。 但是 。。 完美 你 。。 你 一个 更新 。。 神 月 装备 首饰 直接 开 箱子 出 。。 我 彻底 无 语 了 。。 我 又 一次 当 了 那 只 猴子 ， 这些 黄昏 神 月 装备 ， 只要 肯 努力 ， 大家 都 可以 刷 ， 不用 钱 也 可以 ， 门槛 不 低 但 不是 遥不可及 ， 但 完美 你 为什么 让 他们 也 出现 在 你 的 聚宝盆 ？ 连 我们 愿意 为 之 奋斗 的 这 最后 一点 信心 你 也 要 剥夺 吗 ？？ 呵呵 ， 天晓得 今天 我 拼命 去 散财 散 力 去 为 之 努力 的  8  军  16  品 ， 会 不会 在 明天 变成  2  元 钱 的 囊中之物 … 都 说 玩游戏 要端正 心态 ， 但是 在 这个 及 不 公平 的 世界 ， 叫 我 怎样才能 放 平 心态 …. 我 真的 没有 安全感 啊 ， 因为 今天 的 努力 随时 可能 贬值 为  2  块 啊 … 站 在 万 流 。。 看着 水 里 泛滥 的 挂   机 。。 看着 四周 无 帮派 名字 都 一样 的 成群  YJ。  看着 满 世界 高科技 下  FB  还 引以为傲 的 队伍 。。。","title":" 不 「 完美 」 的 完美 ","oriTitle":"不「完美」的完美"},{"uri":"https://redblue.ga/spirits/thinking/ready-player-one","tags":[],"content":" 头号 玩家 影片 背景 设定 在 处于 混乱 和 崩溃 边缘 的  2045  年 ， 现实 世界 令人 失望 ， 人们 将 救赎 的 希望 寄托 于 “ 绿洲 ”， 一个 由 鬼才 詹姆斯 · 哈利 迪 （ 马克 · 里 朗斯   饰 ） 一手 打造 的 虚拟 游戏 宇宙 。 在 那里 ， 想象力 主宰 一切 ， 你 可以 去 任何 地方 ， 做 任何 想 做 的 事 ， 成为 任何 想 成为 的 人  。 哈利 迪 弥留之际 ， 宣布 将 巨额财产 和 “ 绿洲 ” 的 所有权 留给 第一个 闯 过 三道 谜题 ， 找出 他 在 游戏 中 藏匿 彩蛋 的 人 ， 自此 引发 了 一场 全世界 范围 内 的 竞争 。 当 韦德 · 沃 兹 （ 泰尔 · 谢里丹 饰 ） 成为 首位 解 出 第一道 迷题 的 玩家 ， 他 和 他 的 朋友 们 不可避免 地 卷入 了 这场 奇遇 和 凶险 共存 ， 波澜壮阔 的 寻宝 之 旅 —— 为 拯救 “ 绿洲 ”， 也 为 拯救 世界 。 背景 影片 一 开始 就 借 男 主 下楼 的 镜头 和 旁白 来 刻画 了 这个 时代 。 男 主 是  2045  年 的 一位 生活 在 叠 楼 区 的 贫民 孤儿 。 镜头 是 男 主从 楼上 一层 一层 往下跳 ， 每 层楼 的 窗户 展现 了 不同 贫民 的 生活 方式 ： 拳击 、 游戏 、 钢管舞 ……( 这些 贫民 除了 住 的 小 了 点 ， 挤 了 点 完全 不 贫困 的 好 吗 ， 不管 物质 还是 精神 ~ 贫民 不是 应该 白天 为 生活 而 奔波 的 吗 ~ 这 可能 就是 未来 吧 )。 不同 的 人物 形态 放映 出 的 是 全民 娱乐 的 一种 状态 ， 甚至 对 功名 的 追求 从 现实 世界 转向 了 虚拟世界 。 剧情 光 说 剧情 ， 在我看来 男 主 头戴 主角 光环 相当 顺利 就 拿到 了 三 把 钥匙 ， 当然 不乏 有 神秘 网恋 女友 的 帮助 ( 这个 时代 ， 没有 对象 你 都 不 可能 通关 的 ， 呵呵 。。。)， 秒杀 级 和 回档 别人 的 游戏 道具 ， 图书馆 馆长 的 神 助攻 ……emmm， 狗血 的 我 都 有点 不想 吐 槽 ， 不过 后面 快 通关 时 一 开始 签 协议 设有 测试 ， 还有 两 人 的 对话 倒 真的 升华 主题 。 特效 和  IP  刷新 是 高度 刷新 点 啊 ！ 论 主题 规则 是 人类 的 救赎 。 影片 的 结尾 男 主 给 “ 绿洲 ” 世界 定 了 每周 二 周四 服务器 关闭 的 规则 ， 目的 是 让 人们 回到 现实 世界 ， 不 忘记 真实 。 现在 的 中国 ， 不仅仅 是  Z  时代 消费 快 文化 ， 一些 有 一定 文化 程度 ， 甚至 没有 文化 程度 的 老一辈 ， 老 老一辈 也 在 受 快 文化 的 吞噬 。 究其原因 还是 人类 的 本性 懒惰 ， 而 快 文化 正好 把 惰性 与 消费 释放 。 我 非常 清晰 的 记得 影片 中 的 两个 情节 ， 一个 是 男 主 和 队友 聊到 面积 时 的 那段 话 ， 你 不 知道 虚拟世界 背后 的 人 是 男 是 女 ， 是 胖 是 瘦 ， 往往 与 你 的 预期 非常 不符 。 确实 是 这样 ， 不同 三观 的 人 ， 不同 职业 ， 不同 教育 的 人 在 虚拟世界 中 可以 毫无 隔阂 的 成为  Firend…… 或许 这 亦 是 一个 魅力 点 吧 。 另 一个 是 一个 年轻 女子 完全 屏蔽 了 厨房 着火 和 孩子 的 呼喊 拉扯 ， 这 说明 游戏 的 优先级 已经 高于 现实 ， 我 哥 就是 这样 的 ， 我 遇到 的 店员 就是 这样 的 ， 我 的 舍友 更是 这样 的 。 这么 说来 就 不难理解 现在 的 直播 消费 ， 小学生 王者 ， 直播 自杀 ， 做 女主播 …… 不久前 马 云 曾 提议 限制 王者 游戏 ， 一个 用 游戏 业务 上市 的 视频 网站 哔 哩 哔 哩 ，“ 内涵 段子 ” 被 永久 下线 ， 各种 快 视频网 整顿 ， 微 博 整顿 ，QQ  整顿 …… 近来 国家 行政 干预 说明 这些 都 到 一个 临界点 ， 而 规则 是 维持 平衡 最 有力 的 工具 。 越来越 被 科技 支配 的 信息时代 ， 人 与 人 愈来愈 平等 的 ， 背后 其实 是 加大 了 分级 ， 聪明 的 人 在 借 现代 武器 提升 自己 ， 而 那些 控制力 差 人 将 会 在 快 文化 的 洪流 中 越 走 越深 ， 越走越远 ……  头号 玩家 ， 警钟长鸣 ……  关于 快 文化 ， 非常 推荐 一遍 文章  “ 快 文化 ” 崇拜 的 尽头 是 孤独 海 ","title":"「Z 世代 」 规则 是 人类 的 救赎 ","oriTitle":"「Z世代」规则是人类的救赎"},{"uri":"https://redblue.ga/spirits/thinking/tooyoung","tags":[],"content":" 你 学习 一般 ， 考上 了 现在 的 这 所 学校 ， 成绩 不算 好 ， 拿 不到 奖学金 ， 上课 不 听讲 ， 上 自习 不 规律 ， 考试 靠 突击 ， 同学 帮 一把 的话 也 能 每 科考 到 七八 十分 ， 但是 与 优秀 总 有 很大 距离 。 你 家境 一般 ， 父母 都 是 普通员工 ， 你 在 这个 城市 的 生活费 是 每月 一千二 ， 没事 下 下馆子 ， 一个月 添 件 衣服 ， 想 买 台 相机 钱 不够 ， 咬咬牙 才能 买 双 自己 喜欢 的 鞋 。 你 几乎 没有 特长 ， 不会 弹 吉他 ， 不会 弹钢琴 ， 不会 跳舞 ， 不会 画画 ， 想 学 摄影 却 不会 使用 图片 处理软件 ， 想 上台 演出 却 没 信心 ， 学校 晚会 比赛 的 时候 ， 你 经常 是 站 在 台下 围观 的 人群 里 的 一员 ， 你 与 聚光灯 环绕 的 舞台 几乎 绝缘 。 你 长相 一般 ， 不算 英俊 或者 不算 美丽 ， 身材 不算 臃肿 但 也 没什么 肌肉 或者 没什么 曲线 ， 平时 只是 稍稍 打扮 一下 ， 看上去 并 不 出众 ， 只能 算 整洁 ， 与 人 擦肩而过 是 对方 不会 多 留意 你 一眼 。 你 的 感情 也 是 一般 ， 有时候 会 遇见 自己 心仪 的 那个 人 ， 但是 总 抓不住 机会 ， 眨眼 间 那个 人 就 被 其他人 俘获 ， 你 就 开始 伤心 、 抱怨 ， 但是 几天 之后 又 开始 寻找 新 的 心上人 ， 就 这样 看着 一个个 心上人 走过 ， 直到 你 毕业 ， 与 其中 任何 一个 都 没有 发展 。  总之 ， 你 没有 什么 特别 的 地方  ， 就 和 周围 的 千万个 普通人 一样 。 你 不 甘心 拿 不到 奖学金 ， 看见 别人 得 奖学金 的 时候 你 会 说 那 完全 是 突击 的 结果 ， 于是 你 开始 上 自习 ， 不过 你 只 坚持 了 一 星期 。 你 不 甘心 自己 的 父辈 平平 ， 于是 你 批评 讽刺 自己 周围 的 “ 官 二代 ”、“ 富 二代 ”， 立志 要 努力学习 争取 成功 ， 也好 让 自己 的 孩子 成为 “ 富 二代 ”， 你 的 热情 持续 了 一个 星期 。 你 不 甘心 自己 什么 特长 都 没有 ， 于是 你 开始 学 弹 吉他 、 买 滑轮 鞋 、 借来 摄影 方面 的 书籍 ， 你 对 着 镜子 微笑 着 说 ：“ 你 是 最 棒 的 。”  这份 虚假 的 信心 维持 了 一个 星期 。 你 不 甘心 自己 没有 伴侣 ， 你 决心 洗心革面 重新做人 ， 你 删掉 电脑 里 的 偶像剧 肥皂剧 ， 你 收拾 起床 上 的 懒人 桌 ， 把 零食 袋子 统统 扔掉 ， 然后 洗 了 个 澡 并且 修饰 了 一下 自己 ， 你 往 发型 上 喷 了 啫喱 水 ， 好 让 自己 看起来 很 精神 ， 你 怀揣 着 一本 成功 学 的 书 决定 出去 走走 ， 开始 新 的 生活 。 这样 的 状态 ， 你 稀稀拉拉 地 坚持 了 一个 星期 。 一个 星期 之后 ， 你 还是 和 周围 千万 个人 一样 ， 你 还是 和 一 星期 前 的 自己 一样 。 你 逛 网络 论坛 ， 看到 了 这样 一句 话 ：“ 二十岁 是 人生 最 美好 的 时光 ， 不 应该 局限 在 学校 里 教室 里 ， 应该 享受 生活 。”  于是 你 相信 了 ， 你 觉得 二十岁 的 你 就 应该 “ 随心所欲 ”， 享受 “ 人生 中 最后 的 自由 时光 ”； 就 应该 “ 快乐 地 去 恋爱 ”“ 风华正茂 ”“ 挥斥 方 遒 ”······ 现在 的 你 ， 用 着 父母 的 血汗钱 ， 用 着 名牌 包 、 穿着 名牌 跑鞋 、 骑 着 捷安特 山地车 、 用 着 佳能 牌 的 相机 和 苹果 牌 的 手机 ， 还 经常 去 星巴克 喝 喝咖啡 体验 一下 小资 情调 ······ 那么 ， 请 允许 我 猜测 一下 你 的 未来 —— 在 大四 将要 结束 时 ， 你 考研 落榜 。 你 风风火火 的 参加 校园 招聘会 ， 很多 公司 你 都 看不上 ， 嫌 他们 不是 体制 内 单位 、 平台 窄 、 规模 小 ， 直到 毕业 ， 你 还 没有 找到 心仪 的 工作 。 你 收拾 好 行李 回到 老家 ， 父母 让 你 试 着 参加 各种 招聘 考试 或者 参加 当地 的 应聘 会 ， 你 不 去 ， 因为 你 觉得 那些 工作 太 简单 了 ， 不 适合 你 ， 你 应该 去 寻找 更好 的 就业机会 。 可是 ， 当 你 去 那些 你 看 得 上 的 公司 应聘 时 ， 你 的 竞争对手 太 多 了 ， 而且 都 不 差 ， 你 表现 平平 ， 理所当然 地被 拒之门外 ······ 现在 的 你 ， 也许 还 在 上 大学 ， 也许 和 恋人 恩恩爱爱 ， 每天 黏在 一起 ， 午饭 晚饭 一起 去 吃 ， 晚自习 后 还 会 一起 在 操场 散步 。 你们 讨论 起 未来 ， 最后 的 结论 总是 ： 不要 想 得 太 多 ， 认真 过 好 现在 就 好 。  不 幸运 的话 ， 几个 月 后 ， 你们 就 分手 了 ， 你 凄凄惨惨 戚戚 ， 反复 问 自己 究竟 哪里 做 错 了 ； 幸运 的话 ， 你们 会 一直 恋爱 到 毕业 ， 最终 ， 你 绝 得 自己 不够 优秀 没 能力 去 对方 所在 的 城市 读研 或者 工作 ， 所以 你们 带 着 不 舍 和 悔恨 分手 了 。 现实 很 残酷 ， 至此 ， 你 信 了 。 现在 的 你 喜欢 刷 微 博 ， 你 会 全力支持 那些 你 赞同 的 观点 ， 你 会 激励 否定 那些 你 反对 的 观点 。 你 爱憎分明 ， 看起来 很 有 正义感 。 你 觉得 血气方刚 的 年轻人 就 应该 敢于 说出 自己 的 心声 。 你 可能 从来不 会 去 想 一个 问题 ： 你 的 观点 ， 来自 哪里 ？ 其实 ， 它们 绝大部分 来自 网络 ， 它们 已经 蚕食 了 你 的 判断力 。 现在 ， 我 只 想 问 你 一个 问题 ： 二十岁 的 你 ， 有 什么 资本 。 你 只是 千千万万 人 中 微不足道 的 一个 人 ， 少 了 你 ， 地球 还是 一样 会 转 。 我 敢 打赌 ， 一定 很久没 人 和 你 说 过 “ 吃 得 苦 中 苦 ， 方为人上 人 ” 这 句 话 了 吧 ？ 你 知道 “ 责任 ” 两个 字 是 怎么 写 的 吗 ? 当 你 谈论 飞翔 的 时候 ， 你 是不是 忘记 了 地心引力 的 存在 ？ 现在 的 你 ， 如果 还是 放纵 着 自己 的 懒惰 与 幼稚 ， 虚度 着 光阴 ， 那么 ， 你 就 虚度 去 吧 。 反正 我 已经 过 了 二十岁 的 年纪 ， 我 还有 未来 ， 我 得 直奔 向前 了 ， 不 陪 你 了 。 再见 ","title":"「 华文 」 谁 的 青春 不 迷茫 ","oriTitle":"「华文」谁的青春不迷茫"},{"uri":"https://redblue.ga/spirits/thinking/_index","tags":[],"content":"+++linktitle = \" 思考 \"title = \" 君 有 九 思 \"description = \" 能 断 金刚 般若 波罗蜜 多 \"layout=\"list\"+++"}]